
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>10 | DDD、中台和微服务：它们是如何协作的？ · DDD实战课</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="161888.html" />
    
    
    <link rel="prev" href="159580.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">开篇词</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="149941.html">
            
                <a href="149941.html">
            
                    
                    开篇词 | 学好了DDD，你能做什么？
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基础篇</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="149943.html">
            
                <a href="149943.html">
            
                    
                    01 | 领域驱动设计：微服务设计为什么要选择DDD？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="149945.html">
            
                <a href="149945.html">
            
                    
                    02 | 领域、子域、核心域、通用域和支撑域：傻傻分不清？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="149950.html">
            
                <a href="149950.html">
            
                    
                    03 | 限界上下文：定义领域边界的利器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="152677.html">
            
                <a href="152677.html">
            
                    
                    04 | 实体和值对象：从领域模型的基础单元看系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="154547.html">
            
                <a href="154547.html">
            
                    
                    05 | 聚合和聚合根：怎样设计聚合？
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">进阶篇</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="155444.html">
            
                <a href="155444.html">
            
                    
                    06 | 领域事件：解耦微服务的关键
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="156849.html">
            
                <a href="156849.html">
            
                    
                    07 | DDD分层架构：有效降低层与层之间的依赖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="158248.html">
            
                <a href="158248.html">
            
                    
                    08 | 微服务架构模型：几种常见模型的对比和分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="159580.html">
            
                <a href="159580.html">
            
                    
                    09 | 中台：数字转型后到底应该共享什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.5" data-path="161004.html">
            
                <a href="161004.html">
            
                    
                    10 | DDD、中台和微服务：它们是如何协作的？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.6" data-path="161888.html">
            
                <a href="161888.html">
            
                    
                    答疑：有关3个典型问题的讲解
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">实战篇</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="163032.html">
            
                <a href="163032.html">
            
                    
                    11 | DDD实践：如何用DDD重构中台业务模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="163961.html">
            
                <a href="163961.html">
            
                    
                    12 | 领域建模：如何用事件风暴构建领域模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="165248.html">
            
                <a href="165248.html">
            
                    
                    13 | 代码模型（上）：如何使用DDD设计微服务代码模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.4" data-path="166147.html">
            
                <a href="166147.html">
            
                    
                    14 | 代码模型（下）：如何保证领域模型与代码模型的一致性？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.5" data-path="166635.html">
            
                <a href="166635.html">
            
                    
                    15 | 边界：微服务的各种边界在架构演进中的作用？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.6" data-path="167710.html">
            
                <a href="167710.html">
            
                    
                    16 | 视图：如何实现服务和数据在微服务各层的协作？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.7" data-path="169017.html">
            
                <a href="169017.html">
            
                    
                    17 | 从后端到前端：微服务后，前端如何设计？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.8" data-path="169881.html">
            
                <a href="169881.html">
            
                    
                    18 | 知识点串讲：基于DDD的微服务设计实例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.9" data-path="171185.html">
            
                <a href="171185.html">
            
                    
                    19 | 总结（一）：微服务设计和拆分要坚持哪些原则？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.10" data-path="172300.html">
            
                <a href="172300.html">
            
                    
                    20 | 总结（二）：分布式架构关键设计10问
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">结束语</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="172730.html">
            
                <a href="172730.html">
            
                    
                    结束语 | 所谓高手，就是跨过坑和大海！
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">专栏加餐</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="185174.html">
            
                <a href="185174.html">
            
                    
                    基于DDD的微服务设计实例代码详解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="307617.html">
            
                <a href="307617.html">
            
                    
                    抽奖｜《DDD实战课》沉淀成书了，感谢有你！
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">期末测试</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="239046.html">
            
                <a href="239046.html">
            
                    
                    期末测试 | 有关DDD的内容，你掌握了多少呢？
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >10 | DDD、中台和微服务：它们是如何协作的？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="10--ddd&#x3001;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#xFF1A;&#x5B83;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x534F;&#x4F5C;&#x7684;&#xFF1F;">10 | DDD&#x3001;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#xFF1A;&#x5B83;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x534F;&#x4F5C;&#x7684;&#xFF1F;</h1>
<blockquote>
<p>&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x6B27;&#x521B;&#x65B0;&#x3002;&#x4ECA;&#x5929;&#x6211;&#x4E00;&#x8D77;&#x6765;&#x804A;&#x804A;DDD&#x3001;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
</blockquote>
<p>DDD&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x6765;&#x6E90;&#x4E8E;&#x897F;&#x65B9;&#xFF0C;&#x800C;&#x4E2D;&#x53F0;&#x8BDE;&#x751F;&#x4E8E;&#x4E2D;&#x56FD;&#x7684;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x3002;DDD&#x5728;&#x4E8C;&#x5341;&#x591A;&#x5E74;&#x524D;&#x63D0;&#x51FA;&#x540E;&#x4E00;&#x76F4;&#x9ED8;&#x9ED8;&#x524D;&#x884C;&#xFF0C;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x7406;&#x5FF5;&#x8FD1;&#x51E0;&#x5E74;&#x624D;&#x51FA;&#x73B0;&#xFF0C;&#x63D0;&#x51FA;&#x540E;&#x5C31;&#x975E;&#x5E38;&#x706B;&#x7206;&#x3002;&#x8FD9;&#x4E09;&#x8005;&#x770B;&#x4F3C;&#x98CE;&#x9A6C;&#x725B;&#x4E0D;&#x76F8;&#x53CA;&#xFF0C;&#x5B9E;&#x5219;&#x7F18;&#x5206;&#x532A;&#x6D45;&#x3002;&#x4E2D;&#x53F0;&#x662F;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x7684;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x662F;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#x7684;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#xFF0C;DDD&#x4F5C;&#x4E3A;&#x65B9;&#x6CD5;&#x8BBA;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x6307;&#x5BFC;&#x4E2D;&#x53F0;&#x4E1A;&#x52A1;&#x5EFA;&#x6A21;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x5EFA;&#x8BBE;&#xFF0C;&#x4E09;&#x8005;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF0C;&#x5B8C;&#x7F8E;&#x7ED3;&#x5408;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#xFF1A;&#x51ED;&#x4EC0;&#x4E48;DDD&#x53EF;&#x4EE5;&#x6307;&#x5BFC;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x5EFA;&#x8BBE;&#xFF0C;&#x7A76;&#x7ADF;&#x8D77;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#x5462;&#xFF1F;</p>
<p>DDD&#x6709;&#x4E24;&#x628A;&#x5229;&#x5668;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x6218;&#x7565;&#x8BBE;&#x8BA1;&#x548C;&#x6218;&#x672F;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4E2D;&#x53F0;&#x5728;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x4E0A;&#x66F4;&#x591A;&#x504F;&#x5411;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#xFF0C;&#x5F62;&#x6210;&#x4E2D;&#x53F0;&#x7684;&#x8FC7;&#x7A0B;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x662F;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x4E0D;&#x65AD;&#x7EC6;&#x5206;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x5C06;&#x540C;&#x7C7B;&#x901A;&#x7528;&#x7684;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x8FDB;&#x884C;&#x805A;&#x5408;&#x548C;&#x4E1A;&#x52A1;&#x91CD;&#x6784;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x548C;&#x4E1A;&#x52A1;&#x5185;&#x805A;&#x7684;&#x539F;&#x5219;&#x5EFA;&#x7ACB;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x3002;&#x800C;DDD&#x7684;&#x6218;&#x7565;&#x8BBE;&#x8BA1;&#x6700;&#x64C5;&#x957F;&#x7684;&#x5C31;&#x662F;&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x3002;</p>
<p>&#x90A3;&#x5728;&#x4E2D;&#x53F0;&#x5B8C;&#x6210;&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x5FAE;&#x670D;&#x52A1;&#x6765;&#x5B8C;&#x6210;&#x7CFB;&#x7EDF;&#x5EFA;&#x8BBE;&#x3002;&#x6B64;&#x65F6;&#xFF0C;DDD&#x7684;&#x6218;&#x672F;&#x8BBE;&#x8BA1;&#x53C8;&#x6070;&#x597D;&#x53EF;&#x4EE5;&#x4E0E;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x8BBE;&#x8BA1;&#x5B8C;&#x7F8E;&#x7ED3;&#x5408;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x6B63;&#x662F;DDD&#x5B9E;&#x6218;&#x7684;&#x6700;&#x4F73;&#x573A;&#x666F;&#x3002;</p>
<h2 id="ddd&#x7684;&#x672C;&#x8D28;">DDD&#x7684;&#x672C;&#x8D28;</h2>
<p>&#x6211;&#x4EEC;&#x5148;&#x7B80;&#x5355;&#x56DE;&#x987E;&#x4E00;&#x4E0B;DDD&#x9886;&#x57DF;&#x3001;&#x5B50;&#x57DF;&#x3001;&#x6838;&#x5FC3;&#x57DF;&#x3001;&#x901A;&#x7528;&#x57DF;&#x548C;&#x652F;&#x6491;&#x57DF;&#x7B49;&#x6982;&#x5FF5;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x7528;&#x5230;&#x3002;</p>
<p>&#x5728;&#x7814;&#x7A76;&#x548C;&#x89E3;&#x51B3;&#x4E1A;&#x52A1;&#x95EE;&#x9898;&#x65F6;&#xFF0C;DDD&#x4F1A;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x5C06;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x8FDB;&#x884C;&#x7EC6;&#x5206;&#xFF0C;&#x9886;&#x57DF;&#x7EC6;&#x5206;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x7A0B;&#x5EA6;&#x540E;&#xFF0C;DDD&#x4F1A;&#x5C06;&#x95EE;&#x9898;&#x8303;&#x56F4;&#x9650;&#x5B9A;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x8FB9;&#x754C;&#x5185;&#xFF0C;&#x5E76;&#x5728;&#x8FD9;&#x4E2A;&#x8FB9;&#x754C;&#x5185;&#x5EFA;&#x7ACB;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x8FDB;&#x800C;&#x7528;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x8BE5;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x89E3;&#x51B3;&#x76F8;&#x5E94;&#x7684;&#x4E1A;&#x52A1;&#x95EE;&#x9898;&#x3002;&#x9886;&#x57DF;&#x53EF;&#x5206;&#x89E3;&#x4E3A;&#x5B50;&#x57DF;&#xFF0C;&#x5B50;&#x57DF;&#x53EF;&#x7EE7;&#x7EED;&#x5206;&#x4E3A;&#x5B50;&#x5B50;&#x57DF;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x4F60;&#x8BA4;&#x4E3A;&#x9002;&#x5408;&#x5EFA;&#x7ACB;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E3A;&#x6B62;&#x3002;</p>
<p>&#x5B50;&#x57DF;&#x8FD8;&#x4F1A;&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x91CD;&#x8981;&#x6027;&#x548C;&#x529F;&#x80FD;&#x5C5E;&#x6027;&#x5212;&#x5206;&#x4E3A;&#x4E09;&#x7C7B;&#x5B50;&#x57DF;&#xFF0C;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x662F;&#x6838;&#x5FC3;&#x57DF;&#x3001;&#x652F;&#x6491;&#x57DF;&#x548C;&#x901A;&#x7528;&#x57DF;&#x3002;&#x5173;&#x4E8E;&#x8FD9;&#x4E09;&#x7C7B;&#x5B50;&#x57DF;&#x66F4;&#x4E3A;&#x8BE6;&#x7EC6;&#x7684;&#x8BB2;&#x89E3;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x56DE;&#x770B;<a href="https://time.geekbang.org/column/article/149945" target="_blank">[&#x7B2C;02&#x8BB2;]</a>&#x3002;</p>
<p><img src="../assets/images/991b8a5b685d8b0b3e172f38c0460a29.png" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x770B;&#x4E0B;&#x4E0A;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x4FDD;&#x9669;&#x7684;&#x51E0;&#x4E2A;&#x91CD;&#x8981;&#x9886;&#x57DF;&#xFF0C;&#x8FDB;&#x884C;&#x4E86;&#x9AD8;&#x9636;&#x7684;&#x9886;&#x57DF;&#x5212;&#x5206;&#x3002;&#x5F53;&#x7136;&#x6BCF;&#x4E2A;&#x4F01;&#x4E1A;&#x7684;&#x9886;&#x57DF;&#x5B9A;&#x4F4D;&#x548C;&#x804C;&#x8D23;&#x4F1A;&#x6709;&#x4E9B;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x5728;&#x6838;&#x5FC3;&#x57DF;&#x7684;&#x5212;&#x5206;&#x4E0A;&#x80AF;&#x5B9A;&#x4F1A;&#x6709;&#x4E00;&#x5B9A;&#x5DEE;&#x5F02;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x4F60;&#x53BB;&#x505A;&#x9886;&#x57DF;&#x5212;&#x5206;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BF7;&#x52A1;&#x5FC5;&#x7ED3;&#x5408;&#x4F01;&#x4E1A;&#x6218;&#x7565;&#xFF0C;&#x8FD9;&#x6070;&#x6070;&#x4E5F;&#x4F53;&#x73B0;&#x4E86;DDD&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x9886;&#x57DF;&#x5212;&#x5206;&#x548C;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5B50;&#x57DF;&#x5212;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x5B50;&#x57DF;&#x5728;&#x4F01;&#x4E1A;&#x5185;&#x7684;&#x529F;&#x80FD;&#x5C5E;&#x6027;&#x548C;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x8FDB;&#x800C;&#x91C7;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x8D44;&#x6E90;&#x6295;&#x5165;&#x548C;&#x5EFA;&#x8BBE;&#x7B56;&#x7565;&#xFF0C;&#x8FD9;&#x5728;&#x4F01;&#x4E1A;IT&#x7CFB;&#x7EDF;&#x7684;&#x5EFA;&#x8BBE;&#x8FC7;&#x7A0B;&#x4E2D;&#x5341;&#x5206;&#x91CD;&#x8981;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x6837;&#x7684;&#x5212;&#x5206;&#x8FD8;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F01;&#x4E1A;&#x8FDB;&#x884C;&#x4E2D;&#x53F0;&#x8BBE;&#x8BA1;&#x3002;</p>
<h2 id="&#x4E2D;&#x53F0;&#x7684;&#x672C;&#x8D28;">&#x4E2D;&#x53F0;&#x7684;&#x672C;&#x8D28;</h2>
<p>&#x4E2D;&#x53F0;&#x6765;&#x6E90;&#x4E8E;&#x963F;&#x91CC;&#x7684;&#x4E2D;&#x53F0;&#x6218;&#x7565;&#xFF08;&#x8BE6;&#x89C1;&#x300A;&#x4F01;&#x4E1A;IT&#x67B6;&#x6784;&#x8F6C;&#x578B;&#x4E4B;&#x9053;&#xFF1A;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x4E2D;&#x53F0;&#x6218;&#x7565;&#x601D;&#x60F3;&#x4E0E;&#x67B6;&#x6784;&#x5B9E;&#x6218;&#x300B;&#x949F;&#x534E;&#x7F16;&#x8457;&#xFF09;&#x3002;2015&#x5E74;&#x5E74;&#x5E95;&#xFF0C;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x96C6;&#x56E2;&#x5BF9;&#x5916;&#x5BA3;&#x5E03;&#x5168;&#x9762;&#x542F;&#x52A8;&#x4E2D;&#x53F0;&#x6218;&#x7565;&#xFF0C;&#x6784;&#x5EFA;&#x7B26;&#x5408;&#x6570;&#x5B57;&#x65F6;&#x4EE3;&#x7684;&#x66F4;&#x5177;&#x521B;&#x65B0;&#x6027;&#x3001;&#x7075;&#x6D3B;&#x6027;&#x7684;&#x201C;&#x5927;&#x4E2D;&#x53F0;&#x3001;&#x5C0F;&#x524D;&#x53F0;&#x201D;&#x7EC4;&#x7EC7;&#x673A;&#x5236;&#x548C;&#x4E1A;&#x52A1;&#x673A;&#x5236;&#xFF0C;&#x5373;&#x4F5C;&#x4E3A;&#x524D;&#x53F0;&#x7684;&#x4E00;&#x7EBF;&#x4E1A;&#x52A1;&#x4F1A;&#x66F4;&#x654F;&#x6377;&#x3001;&#x66F4;&#x5FEB;&#x901F;&#x5730;&#x9002;&#x5E94;&#x77AC;&#x606F;&#x4E07;&#x53D8;&#x7684;&#x5E02;&#x573A;&#xFF0C;&#x800C;&#x4E2D;&#x53F0;&#x5C06;&#x96C6;&#x5408;&#x6574;&#x4E2A;&#x96C6;&#x56E2;&#x7684;&#x8FD0;&#x8425;&#x6570;&#x636E;&#x80FD;&#x529B;&#x3001;&#x4EA7;&#x54C1;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF0C;&#x5BF9;&#x5404;&#x524D;&#x53F0;&#x4E1A;&#x52A1;&#x5F62;&#x6210;&#x5F3A;&#x529B;&#x652F;&#x6491;&#x3002;</p>
<p>&#x4E2D;&#x53F0;&#x7684;&#x672C;&#x8D28;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x63D0;&#x70BC;&#x5404;&#x4E2A;&#x4E1A;&#x52A1;&#x677F;&#x5757;&#x7684;&#x5171;&#x540C;&#x9700;&#x6C42;&#xFF0C;&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x548C;&#x7CFB;&#x7EDF;&#x62BD;&#x8C61;&#xFF0C;&#x5F62;&#x6210;&#x901A;&#x7528;&#x7684;&#x53EF;&#x590D;&#x7528;&#x7684;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#xFF0C;&#x6253;&#x9020;&#x6210;&#x7EC4;&#x4EF6;&#x5316;&#x4EA7;&#x54C1;&#xFF0C;&#x4F9B;&#x524D;&#x53F0;&#x90E8;&#x95E8;&#x4F7F;&#x7528;&#x3002;&#x524D;&#x53F0;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x4E1A;&#x52A1;&#xFF0C;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x627E;&#x4E2D;&#x53F0;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x90FD;&#x53BB;&#x6539;&#x52A8;&#x81EA;&#x5DF1;&#x7684;&#x5E95;&#x5C42;&#x3002;</p>
<h2 id="ddd&#x3001;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;">DDD&#x3001;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;</h2>
<p>&#x6211;&#x4EEC;&#x5728; <a href="https://time.geekbang.org/column/article/159580" target="_blank">[&#x7B2C;09&#x8BB2;]</a> &#x5DF2;&#x7ECF;&#x8BF4;&#x8FC7;&#x4E86;&#x4F20;&#x7EDF;&#x4F01;&#x4E1A;&#x548C;&#x963F;&#x91CC;&#x4E2D;&#x53F0;&#x6218;&#x7565;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x90A3;&#x5B9E;&#x9645;&#x4E0A;&#x66F4;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x8FD8;&#x662F;&#x4F1A;&#x805A;&#x7126;&#x5728;&#x4F20;&#x7EDF;&#x4F01;&#x4E1A;&#x4E2D;&#x53F0;&#x5EFA;&#x8BBE;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5C06;&#x901A;&#x7528;&#x80FD;&#x529B;&#x4E0E;&#x6838;&#x5FC3;&#x80FD;&#x529B;&#x5168;&#x90E8;&#x4E2D;&#x53F0;&#x5316;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x4E0D;&#x540C;&#x6E20;&#x9053;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x590D;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C31;&#x8FD8;&#x662F;&#x628A;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x4F20;&#x7EDF;&#x4F01;&#x4E1A;&#x4E0A;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x4F01;&#x4E1A;&#x53EF;&#x4EE5;&#x5C06;&#x9700;&#x8981;&#x5171;&#x4EAB;&#x7684;&#x516C;&#x5171;&#x80FD;&#x529B;&#x8FDB;&#x884C;&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#xFF0C;&#x5EFA;&#x8BBE;&#x53EF;&#x5171;&#x4EAB;&#x7684;<strong>&#x901A;&#x7528;&#x4E2D;&#x53F0;</strong>&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4F20;&#x7EDF;&#x4F01;&#x4E1A;&#x8FD8;&#x4F1A;&#x5C06;&#x6838;&#x5FC3;&#x80FD;&#x529B;&#x8FDB;&#x884C;&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#xFF0C;&#x5EFA;&#x8BBE;&#x9762;&#x5411;&#x4E0D;&#x540C;&#x6E20;&#x9053;&#x7684;&#x53EF;&#x590D;&#x7528;&#x7684;<strong>&#x6838;&#x5FC3;&#x4E2D;&#x53F0;</strong>&#x3002;</p>
<p>&#x800C;&#x8FD9;&#x91CC;&#x7684;&#x901A;&#x7528;&#x4E2D;&#x53F0;&#x548C;&#x6838;&#x5FC3;&#x4E2D;&#x53F0;&#x90FD;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#x4E0A;&#x4E00;&#x8BB2;&#x8BB2;&#x5230;&#x7684;&#x4E1A;&#x52A1;&#x4E2D;&#x53F0;&#x7684;&#x8303;&#x7574;&#x3002;</p>
<p>DDD&#x7684;&#x5B50;&#x57DF;&#x5206;&#x4E3A;&#x6838;&#x5FC3;&#x57DF;&#x3001;&#x901A;&#x7528;&#x57DF;&#x548C;&#x652F;&#x6491;&#x57DF;&#x3002;&#x5212;&#x5206;&#x8FD9;&#x51E0;&#x4E2A;&#x5B50;&#x57DF;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x786E;&#x5B9A;&#x6218;&#x7565;&#x8D44;&#x6E90;&#x7684;&#x6295;&#x5165;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x6218;&#x7565;&#x6295;&#x5165;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x6838;&#x5FC3;&#x57DF;&#xFF0C;&#x56E0;&#x6B64;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x6682;&#x65F6;&#x4E0D;&#x4E25;&#x683C;&#x533A;&#x5206;&#x652F;&#x6491;&#x57DF;&#x548C;&#x901A;&#x7528;&#x57DF;&#x4E86;&#x3002;</p>
<p>&#x9886;&#x57DF;&#x3001;&#x4E2D;&#x53F0;&#x4EE5;&#x53CA;&#x5FAE;&#x670D;&#x52A1;&#x867D;&#x7136;&#x5C5E;&#x4E8E;&#x4E0D;&#x540C;&#x5C42;&#x9762;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x5C06;&#x4ED6;&#x4EEC;&#x5206;&#x89E3;&#x5BF9;&#x7167;&#xFF0C;&#x6574;&#x7406;&#x51FA;&#x6765;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4F60;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x6211;&#x662F;&#x4ECE;DDD&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x548C;&#x4E2D;&#x53F0;&#x5EFA;&#x8BBE;&#x8FD9;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x89C6;&#x89D2;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x7684;&#x4E1A;&#x52A1;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3002;</p>
<p><img src="../assets/images/c647561ff910f97b8500b75de70281df.png" alt=""></p>
<p>&#x5982;&#x679C;&#x5C06;&#x4F01;&#x4E1A;&#x5185;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x57DF;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x57DF;&#x7684;&#x8BDD;&#xFF0C;&#x4F01;&#x4E1A;&#x5185;&#x7684;&#x6240;&#x6709;&#x4E1A;&#x52A1;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x3002;&#x5728;&#x8FDB;&#x884C;&#x9886;&#x57DF;&#x7EC6;&#x5206;&#x65F6;&#xFF0C;&#x4ECE;DDD&#x89C6;&#x89D2;&#x6765;&#x770B;&#xFF0C;&#x5B50;&#x57DF;&#x53EF;&#x5206;&#x4E3A;&#x6838;&#x5FC3;&#x57DF;&#x3001;&#x901A;&#x7528;&#x57DF;&#x548C;&#x652F;&#x6491;&#x57DF;&#x3002;&#x4ECE;&#x4E2D;&#x53F0;&#x5EFA;&#x8BBE;&#x7684;&#x89C6;&#x89D2;&#x6765;&#x770B;&#xFF0C;&#x4E1A;&#x52A1;&#x57DF;&#x7EC6;&#x5206;&#x540E;&#x7684;&#x4E1A;&#x52A1;&#x4E2D;&#x53F0;&#xFF0C;&#x53EF;&#x5206;&#x4E3A;&#x6838;&#x5FC3;&#x4E2D;&#x53F0;&#x548C;&#x901A;&#x7528;&#x4E2D;&#x53F0;&#x3002;</p>
<p>&#x4ECE;&#x9886;&#x57DF;&#x529F;&#x80FD;&#x5C5E;&#x6027;&#x548C;&#x91CD;&#x8981;&#x6027;&#x5BF9;&#x7167;&#x6765;&#x770B;&#xFF0C;&#x901A;&#x7528;&#x4E2D;&#x53F0;&#x5BF9;&#x5E94;DDD&#x7684;&#x901A;&#x7528;&#x57DF;&#x548C;&#x652F;&#x6491;&#x57DF;&#xFF0C;&#x6838;&#x5FC3;&#x4E2D;&#x53F0;&#x5BF9;&#x5E94;DDD&#x7684;&#x6838;&#x5FC3;&#x57DF;&#x3002;&#x4ECE;&#x9886;&#x57DF;&#x7684;&#x529F;&#x80FD;&#x8303;&#x56F4;&#x6765;&#x770B;&#xFF0C;&#x5B50;&#x57DF;&#x4E0E;&#x4E2D;&#x53F0;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x6240;&#x5728;&#x7684;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x5BF9;&#x5E94;&#x5FAE;&#x670D;&#x52A1;&#x3002;&#x5EFA;&#x7ACB;&#x4E86;&#x8FD9;&#x4E2A;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7528;DDD&#x6765;&#x8FDB;&#x884C;&#x4E2D;&#x53F0;&#x4E1A;&#x52A1;&#x5EFA;&#x6A21;&#x4E86;&#x3002;</p>
<p><strong>&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x8FD8;&#x662F;&#x4EE5;&#x4FDD;&#x9669;&#x9886;&#x57DF;&#x4E3A;&#x4F8B;&#x3002;</strong>&#x4FDD;&#x9669;&#x57DF;&#x7684;&#x4E1A;&#x52A1;&#x4E2D;&#x53F0;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;&#x7B2C;&#x4E00;&#x7C7B;&#x662F;&#x63D0;&#x4F9B;&#x4FDD;&#x9669;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x7684;&#x6838;&#x5FC3;&#x4E2D;&#x53F0;&#xFF08;&#x6BD4;&#x5982;&#x8425;&#x9500;&#x3001;&#x627F;&#x4FDD;&#x548C;&#x7406;&#x8D54;&#x7B49;&#x4E1A;&#x52A1;&#xFF09;&#xFF1B;&#x7B2C;&#x4E8C;&#x7C7B;&#x662F;&#x652F;&#x6491;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x5B8C;&#x6210;&#x4FDD;&#x9669;&#x5168;&#x6D41;&#x7A0B;&#x7684;&#x901A;&#x7528;&#x4E2D;&#x53F0;&#xFF08;&#x6BD4;&#x5982;&#x8BA2;&#x5355;&#x3001;&#x652F;&#x4ED8;&#x3001;&#x5BA2;&#x6237;&#x548C;&#x7528;&#x6237;&#x7B49;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x8981;&#x63D0;&#x9192;&#x4F60;&#x4E00;&#x4E0B;&#xFF1A;&#x6839;&#x636E;DDD&#x9996;&#x5148;&#x8981;&#x5EFA;&#x7ACB;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x5728;&#x5C06;DDD&#x7684;&#x65B9;&#x6CD5;&#x5F15;&#x5165;&#x4E2D;&#x53F0;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5148;&#x5EFA;&#x7ACB;&#x4E2D;&#x53F0;&#x548C;DDD&#x7684;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5B50;&#x57DF;&#x4E0E;&#x4E2D;&#x53F0;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x5B50;&#x57DF;&#x7EDF;&#x4E00;&#x4E3A;&#x4E2D;&#x53F0;&#x3002;</p>
<p>&#x4E2D;&#x53F0;&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#x98CE;&#x66B4;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x7EC6;&#x5206;&#xFF0C;&#x6700;&#x7EC8;&#x5B8C;&#x6210;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x3002;&#x4E2D;&#x53F0;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x7684;&#x529F;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x6570;&#x91CF;&#x548C;&#x5927;&#x5C0F;&#x5C31;&#x4F1A;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E5F;&#x4F1A;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5F53;&#x5B8C;&#x6210;&#x4E1A;&#x52A1;&#x5EFA;&#x6A21;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x91C7;&#x7528;DDD&#x6218;&#x672F;&#x8BBE;&#x8BA1;&#xFF0C;&#x8BBE;&#x8BA1;&#x51FA;&#x805A;&#x5408;&#x3001;&#x5B9E;&#x4F53;&#x3001;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x3001;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4EE5;&#x53CA;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x7B49;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#xFF0C;&#x518D;&#x5229;&#x7528;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x5B8C;&#x6210;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;DDD&#x3001;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x5728;&#x5E94;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;&#x3002;</p>
<h2 id="&#x4E2D;&#x53F0;&#x5982;&#x4F55;&#x5EFA;&#x6A21;&#xFF1F;">&#x4E2D;&#x53F0;&#x5982;&#x4F55;&#x5EFA;&#x6A21;&#xFF1F;</h2>
<p>&#x770B;&#x5B8C;&#x4E86;&#x4E09;&#x8005;&#x7684;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x987A;&#x7740;&#x4E0A;&#x9762;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x63A5;&#x7740;&#x6765;&#x804A;&#x804A;&#x4E2D;&#x53F0;&#x5982;&#x4F55;&#x5EFA;&#x6A21;&#x3002;</p>
<p>&#x4E2D;&#x53F0;&#x4E1A;&#x52A1;&#x62BD;&#x8C61;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x4E1A;&#x52A1;&#x5EFA;&#x6A21;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5BF9;&#x5E94;DDD&#x7684;&#x6218;&#x7565;&#x8BBE;&#x8BA1;&#x3002;&#x7CFB;&#x7EDF;&#x62BD;&#x8C61;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5EFA;&#x8BBE;&#x8FC7;&#x7A0B;&#xFF0C;&#x5BF9;&#x5E94;DDD&#x7684;&#x6218;&#x672F;&#x8BBE;&#x8BA1;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x7ED3;&#x5408;DDD&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BB2;&#x4E00;&#x4E0B;&#x4E2D;&#x53F0;&#x4E1A;&#x52A1;&#x5EFA;&#x6A21;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;</strong>&#x6309;&#x7167;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#xFF08;&#x901A;&#x5E38;&#x9002;&#x7528;&#x4E8E;&#x6838;&#x5FC3;&#x57DF;&#xFF09;&#x6216;&#x8005;&#x529F;&#x80FD;&#x5C5E;&#x6027;&#x3001;&#x96C6;&#x5408;&#xFF08;&#x901A;&#x5E38;&#x9002;&#x7528;&#x4E8E;&#x901A;&#x7528;&#x57DF;&#x6216;&#x652F;&#x6491;&#x57DF;&#xFF09;&#xFF0C;&#x5C06;&#x4E1A;&#x52A1;&#x57DF;&#x7EC6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x4E2D;&#x53F0;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x529F;&#x80FD;&#x5C5E;&#x6027;&#x6216;&#x91CD;&#x8981;&#x6027;&#x5F52;&#x7C7B;&#x5230;&#x6838;&#x5FC3;&#x4E2D;&#x53F0;&#x6216;&#x901A;&#x7528;&#x4E2D;&#x53F0;&#x3002;&#x6838;&#x5FC3;&#x4E2D;&#x53F0;&#x8BBE;&#x8BA1;&#x65F6;&#x8981;&#x8003;&#x8651;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x901A;&#x7528;&#x4E2D;&#x53F0;&#x8981;&#x7AD9;&#x5728;&#x4F01;&#x4E1A;&#x9AD8;&#x5EA6;&#x8003;&#x8651;&#x5171;&#x4EAB;&#x548C;&#x590D;&#x7528;&#x80FD;&#x529B;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;</strong>&#x9009;&#x53D6;&#x4E2D;&#x53F0;&#xFF0C;&#x6839;&#x636E;&#x7528;&#x4F8B;&#x3001;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x6216;&#x7528;&#x6237;&#x65C5;&#x7A0B;&#x5B8C;&#x6210;&#x4E8B;&#x4EF6;&#x98CE;&#x66B4;&#xFF0C;&#x627E;&#x51FA;&#x5B9E;&#x4F53;&#x3001;&#x805A;&#x5408;&#x548C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x4F9D;&#x6B21;&#x8FDB;&#x884C;&#x9886;&#x57DF;&#x5206;&#x89E3;&#xFF0C;&#x5EFA;&#x7ACB;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x4E0D;&#x540C;&#x4E2D;&#x53F0;&#x72EC;&#x7ACB;&#x5EFA;&#x6A21;&#xFF0C;&#x67D0;&#x4E9B;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x6216;&#x529F;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#x5728;&#x5176;&#x5B83;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x672C;&#x8BE5;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x805A;&#x5408;&#x7684;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x6216;&#x529F;&#x80FD;&#xFF0C;&#x5374;&#x5206;&#x6563;&#x5728;&#x5176;&#x5B83;&#x7684;&#x4E2D;&#x53F0;&#x91CC;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x5BFC;&#x81F4;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E0D;&#x5B8C;&#x6574;&#x6216;&#x8005;&#x4E1A;&#x52A1;&#x4E0D;&#x5185;&#x805A;&#x3002;&#x8FD9;&#x91CC;&#x5148;&#x4E0D;&#x8981;&#x7740;&#x6025;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x521D;&#x6B65;&#x786E;&#x5B9A;&#x4E3B;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x5728;&#x7B2C;&#x4E09;&#x6B65;&#x4E2D;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x63D0;&#x70BC;&#x5E76;&#x91CD;&#x7EC4;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E09;&#x6B65;&#xFF1A;</strong>&#x4EE5;&#x4E3B;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x626B;&#x63CF;&#x5176;&#x5B83;&#x4E2D;&#x53F0;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x68C0;&#x67E5;&#x5E76;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x5B58;&#x5728;&#x91CD;&#x590D;&#x6216;&#x8005;&#x9700;&#x8981;&#x91CD;&#x7EC4;&#x7684;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x3001;&#x529F;&#x80FD;&#xFF0C;&#x63D0;&#x70BC;&#x5E76;&#x91CD;&#x6784;&#x4E3B;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x5B8C;&#x6210;&#x6700;&#x7EC8;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x8BBE;&#x8BA1;&#x3002;</p>
<p><strong>&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;</strong>&#x9009;&#x62E9;&#x5176;&#x5B83;&#x4E3B;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x91CD;&#x590D;&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x6709;&#x4E3B;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5B8C;&#x6210;&#x6BD4;&#x5BF9;&#x548C;&#x91CD;&#x6784;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;</strong>&#x57FA;&#x4E8E;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5B8C;&#x6210;&#x5FAE;&#x670D;&#x52A1;&#x8BBE;&#x8BA1;&#xFF0C;&#x5B8C;&#x6210;&#x7CFB;&#x7EDF;&#x843D;&#x5730;&#x3002;</p>
<p><img src="../assets/images/3caae85ef680eb7cbc2ffb5c6a603f47.png" alt=""></p>
<p>&#x7ED3;&#x5408;&#x4E0A;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x4E86;&#x89E3;&#x5230;DDD&#x4E2D;&#x53F0;&#x8BBE;&#x8BA1;&#x7684;&#x8FC7;&#x7A0B;&#x3002;DDD&#x6218;&#x7565;&#x8BBE;&#x8BA1;&#x5305;&#x62EC;&#x4E0A;&#x8FF0;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x5230;&#x7B2C;&#x56DB;&#x6B65;&#xFF0C;&#x4E3B;&#x8981;&#x4E3A;&#xFF1A;&#x4E1A;&#x52A1;&#x57DF;&#x5206;&#x89E3;&#x4E3A;&#x4E2D;&#x53F0;&#xFF0C;&#x5BF9;&#x4E2D;&#x53F0;&#x5F52;&#x7C7B;&#xFF0C;&#x5B8C;&#x6210;&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E2D;&#x53F0;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#x3002;DDD&#x6218;&#x672F;&#x8BBE;&#x8BA1;&#x662F;&#x7B2C;&#x4E94;&#x6B65;&#xFF0C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x6620;&#x5C04;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x5B8C;&#x6210;&#x4E2D;&#x53F0;&#x5EFA;&#x8BBE;&#x3002;</p>
<p><img src="../assets/images/45de1af6a4b5dd6cf54921ff9f422571.png" alt=""></p>
<p>&#x90A3;&#x4E48;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x4EE5;&#x4FDD;&#x9669;&#x9886;&#x57DF;&#x4E3A;&#x4F8B;&#x7684;&#x8BDD;&#xFF0C;&#x5B8C;&#x6210;&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x540E;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x6570;&#x636E;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x586B;&#x4E0A;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x9009;&#x53D6;&#x4E86;&#x901A;&#x7528;&#x4E2D;&#x53F0;&#x7684;&#x7528;&#x6237;&#x3001;&#x5BA2;&#x6237;&#x548C;&#x8BA2;&#x5355;&#x4E09;&#x4E2A;&#x4E2D;&#x53F0;&#x6765;&#x505A;&#x793A;&#x4F8B;&#x3002;&#x5BA2;&#x6237;&#x4E2D;&#x53F0;&#x63D0;&#x70BC;&#x51FA;&#x4E86;&#x4E24;&#x4E2A;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF1A;&#x5BA2;&#x6237;&#x4FE1;&#x606F;&#x548C;&#x5BA2;&#x6237;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x3002;&#x7528;&#x6237;&#x4E2D;&#x53F0;&#x63D0;&#x70BC;&#x51FA;&#x4E86;&#x4E09;&#x4E2A;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF1A;&#x7528;&#x6237;&#x7BA1;&#x7406;&#x3001;&#x767B;&#x5F55;&#x8BA4;&#x8BC1;&#x548C;&#x6743;&#x9650;&#x6A21;&#x578B;&#x3002;&#x8BA2;&#x5355;&#x4E2D;&#x53F0;&#x63D0;&#x70BC;&#x51FA;&#x4E86;&#x8BA2;&#x5355;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E2D;&#x53F0;&#x5EFA;&#x6A21;&#x7684;&#x5168;&#x6D41;&#x7A0B;&#xFF0C;&#x5F53;&#x7136;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x80CC;&#x540E;&#xFF0C;&#x82E5;&#x662F;&#x9047;&#x4E0A;&#x590D;&#x6742;&#x7684;&#x4E1A;&#x52A1;&#x603B;&#x4F1A;&#x51FA;&#x73B0;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x7136;&#x5E94;&#x7528;&#x8D77;&#x6765;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x56F0;&#x96BE;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x6309;&#x7167;&#x4EE5;&#x4E0A;&#x6D41;&#x7A0B;&#x5B9E;&#x65BD;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x6B22;&#x8FCE;&#x5728;&#x7559;&#x8A00;&#x533A;&#x548C;&#x6211;&#x8BA8;&#x8BBA;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x4E86;&#x4F20;&#x7EDF;&#x4F01;&#x4E1A;&#x4E2D;&#x53F0;&#x5EFA;&#x8BBE;&#x7684;&#x4E00;&#x4E9B;&#x601D;&#x8DEF;&#xFF0C;&#x68B3;&#x7406;&#x4E86;DDD&#x3001;&#x4E2D;&#x53F0;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5173;&#x7CFB;&#x3002;DDD&#x7684;&#x6218;&#x7565;&#x8BBE;&#x8BA1;&#x53EF;&#x7528;&#x4E8E;&#x4E2D;&#x53F0;&#x4E1A;&#x52A1;&#x5EFA;&#x6A21;&#xFF0C;&#x6218;&#x672F;&#x8BBE;&#x8BA1;&#x53EF;&#x6307;&#x5BFC;&#x4E2D;&#x53F0;&#x5FAE;&#x670D;&#x52A1;&#x8BBE;&#x8BA1;&#x3002;&#x76F8;&#x4FE1;DDD&#x4E0E;&#x4E2D;&#x53F0;&#x7684;&#x5B8C;&#x7F8E;&#x7ED3;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x7684;&#x4E2D;&#x53F0;&#x5EFA;&#x8BBE;&#x5982;&#x864E;&#x6DFB;&#x7FFC;&#xFF01;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x8FD9;&#x4E00;&#x8BB2;&#x53EA;&#x662F;&#x5F00;&#x4E00;&#x4E2A;&#x5934;&#xFF0C;&#x5728;&#x4E0B;&#x4E00;&#x8BB2;&#x4E2D;&#x6211;&#x8FD8;&#x4F1A;&#x4EE5;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x7684;&#x4E2D;&#x53F0;&#x5EFA;&#x8BBE;&#x6848;&#x4F8B;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x4E2D;&#x53F0;&#x7684;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x3002;</p>
<h2 id="&#x601D;&#x8003;&#x9898;">&#x601D;&#x8003;&#x9898;</h2>
<p>&#x4F60;&#x7684;&#x4F01;&#x4E1A;&#x662F;&#x5426;&#x5728;&#x505A;&#x4E2D;&#x53F0;&#xFF1F;&#x73B0;&#x5728;&#x662F;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#x505A;&#x4E2D;&#x53F0;&#x4E1A;&#x52A1;&#x5EFA;&#x6A21;&#x5462;&#xFF1F;&#x548C;DDD&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x5B70;&#x4F18;&#x5B70;&#x52A3;&#xFF1F;</p>
<p>&#x6B22;&#x8FCE;&#x7559;&#x8A00;&#x5206;&#x4EAB;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x4ECA;&#x5929;&#x6240;&#x5B66;&#x5206;&#x4EAB;&#x7ED9;&#x8EAB;&#x8FB9;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x9080;&#x8BF7;&#x4ED6;&#x4E00;&#x540C;&#x4EA4;&#x6D41;&#x3001;&#x6253;&#x5361;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="159580.html" class="navigation navigation-prev " aria-label="Previous page: 09 | 中台：数字转型后到底应该共享什么？">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="161888.html" class="navigation navigation-next " aria-label="Next page: 答疑：有关3个典型问题的讲解">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"10 | DDD、中台和微服务：它们是如何协作的？","level":"4.5","depth":1,"next":{"title":"答疑：有关3个典型问题的讲解","level":"4.6","depth":1,"path":"docs/161888.md","ref":"./docs/161888.md","articles":[]},"previous":{"title":"09 | 中台：数字转型后到底应该共享什么？","level":"4.4","depth":1,"path":"docs/159580.md","ref":"./docs/159580.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"d4t":{"nav":[{"url":"../book_10x_cheng_xu_yuan_gong_zuo_fa/","target":"_self","name":"10x程序员工作法"},{"url":"../book_da_chang_jin_sheng_zhi_nan/","target":"_self","name":"大厂晋升指南"},{"url":"https://github.com/auohh/","target":"_blank","name":"Github"}]}},"title":"DDD实战课","language":"zh","gitbook":"*"},"file":{"path":"docs/161004.md","mtime":"2025-10-30T15:39:20.762Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2025-10-30T15:40:20.318Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

