
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>13 | 代码模型（上）：如何使用DDD设计微服务代码模型？ · DDD实战课</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="166147.html" />
    
    
    <link rel="prev" href="163961.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">开篇词</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="149941.html">
            
                <a href="149941.html">
            
                    
                    开篇词 | 学好了DDD，你能做什么？
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基础篇</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="149943.html">
            
                <a href="149943.html">
            
                    
                    01 | 领域驱动设计：微服务设计为什么要选择DDD？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="149945.html">
            
                <a href="149945.html">
            
                    
                    02 | 领域、子域、核心域、通用域和支撑域：傻傻分不清？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="149950.html">
            
                <a href="149950.html">
            
                    
                    03 | 限界上下文：定义领域边界的利器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="152677.html">
            
                <a href="152677.html">
            
                    
                    04 | 实体和值对象：从领域模型的基础单元看系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="154547.html">
            
                <a href="154547.html">
            
                    
                    05 | 聚合和聚合根：怎样设计聚合？
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">进阶篇</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="155444.html">
            
                <a href="155444.html">
            
                    
                    06 | 领域事件：解耦微服务的关键
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="156849.html">
            
                <a href="156849.html">
            
                    
                    07 | DDD分层架构：有效降低层与层之间的依赖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="158248.html">
            
                <a href="158248.html">
            
                    
                    08 | 微服务架构模型：几种常见模型的对比和分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="159580.html">
            
                <a href="159580.html">
            
                    
                    09 | 中台：数字转型后到底应该共享什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.5" data-path="161004.html">
            
                <a href="161004.html">
            
                    
                    10 | DDD、中台和微服务：它们是如何协作的？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.6" data-path="161888.html">
            
                <a href="161888.html">
            
                    
                    答疑：有关3个典型问题的讲解
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">实战篇</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="163032.html">
            
                <a href="163032.html">
            
                    
                    11 | DDD实践：如何用DDD重构中台业务模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="163961.html">
            
                <a href="163961.html">
            
                    
                    12 | 领域建模：如何用事件风暴构建领域模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="5.3" data-path="165248.html">
            
                <a href="165248.html">
            
                    
                    13 | 代码模型（上）：如何使用DDD设计微服务代码模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.4" data-path="166147.html">
            
                <a href="166147.html">
            
                    
                    14 | 代码模型（下）：如何保证领域模型与代码模型的一致性？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.5" data-path="166635.html">
            
                <a href="166635.html">
            
                    
                    15 | 边界：微服务的各种边界在架构演进中的作用？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.6" data-path="167710.html">
            
                <a href="167710.html">
            
                    
                    16 | 视图：如何实现服务和数据在微服务各层的协作？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.7" data-path="169017.html">
            
                <a href="169017.html">
            
                    
                    17 | 从后端到前端：微服务后，前端如何设计？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.8" data-path="169881.html">
            
                <a href="169881.html">
            
                    
                    18 | 知识点串讲：基于DDD的微服务设计实例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.9" data-path="171185.html">
            
                <a href="171185.html">
            
                    
                    19 | 总结（一）：微服务设计和拆分要坚持哪些原则？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.10" data-path="172300.html">
            
                <a href="172300.html">
            
                    
                    20 | 总结（二）：分布式架构关键设计10问
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">结束语</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="172730.html">
            
                <a href="172730.html">
            
                    
                    结束语 | 所谓高手，就是跨过坑和大海！
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">专栏加餐</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="185174.html">
            
                <a href="185174.html">
            
                    
                    基于DDD的微服务设计实例代码详解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="307617.html">
            
                <a href="307617.html">
            
                    
                    抽奖｜《DDD实战课》沉淀成书了，感谢有你！
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">期末测试</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="239046.html">
            
                <a href="239046.html">
            
                    
                    期末测试 | 有关DDD的内容，你掌握了多少呢？
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >13 | 代码模型（上）：如何使用DDD设计微服务代码模型？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="13--&#x4EE3;&#x7801;&#x6A21;&#x578B;&#xFF08;&#x4E0A;&#xFF09;&#xFF1A;&#x5982;&#x4F55;&#x4F7F;&#x7528;ddd&#x8BBE;&#x8BA1;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#xFF1F;">13 | &#x4EE3;&#x7801;&#x6A21;&#x578B;&#xFF08;&#x4E0A;&#xFF09;&#xFF1A;&#x5982;&#x4F55;&#x4F7F;&#x7528;DDD&#x8BBE;&#x8BA1;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#xFF1F;</h1>
<blockquote>
<p>&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x6B27;&#x521B;&#x65B0;&#x3002;</p>
</blockquote>
<p>&#x4E0A;&#x4E00;&#x8BB2;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x4E86;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x5F00;&#x59CB;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x843D;&#x5730;&#x4E86;&#x3002;&#x90A3;&#x5FAE;&#x670D;&#x52A1;&#x843D;&#x5730;&#x65F6;&#x9996;&#x5148;&#x8981;&#x786E;&#x5B9A;&#x7684;&#x5C31;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4ECA;&#x5929;&#x8981;&#x8BB2;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x53EA;&#x6709;&#x5EFA;&#x7ACB;&#x4E86;&#x6807;&#x51C6;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x548C;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x53EF;&#x4EE5;&#x5C06;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x5BF9;&#x8C61;&#x653E;&#x5728;&#x5408;&#x9002;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x4E2D;&#x3002;&#x6807;&#x51C6;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x8BA9;&#x9879;&#x76EE;&#x56E2;&#x961F;&#x6210;&#x5458;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#xFF0C;&#x6839;&#x636E;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x5B9E;&#x73B0;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#xFF1B;&#x8FD8;&#x53EF;&#x4EE5;&#x8BA9;&#x5FAE;&#x670D;&#x52A1;&#x5404;&#x5C42;&#x7684;&#x903B;&#x8F91;&#x4E92;&#x4E0D;&#x5E72;&#x6270;&#x3001;&#x5206;&#x5DE5;&#x534F;&#x4F5C;&#x3001;&#x5404;&#x636E;&#x5176;&#x4F4D;&#x3001;&#x5404;&#x53F8;&#x5176;&#x804C;&#xFF0C;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4EE3;&#x7801;&#x6DF7;&#x6DC6;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6807;&#x51C6;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x8FD8;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x65F6;&#xFF0C;&#x8F7B;&#x677E;&#x5B8C;&#x6210;&#x4EE3;&#x7801;&#x91CD;&#x6784;&#x3002;</p>
<p>&#x90A3;&#x5728;DDD&#x91CC;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x53C8;&#x662F;&#x4F9D;&#x636E;&#x4EC0;&#x4E48;&#x6765;&#x5EFA;&#x7ACB;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#xFF1F;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x91CD;&#x70B9;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="ddd&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E0E;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;">DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E0E;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;</h2>
<p>&#x6211;&#x4EEC;&#x53C2;&#x8003;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x6765;&#x8BBE;&#x8BA1;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x3002;&#x6CA1;&#x9519;&#xFF01;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x5C31;&#x662F;&#x4F9D;&#x636E;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x7684;&#x3002;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x5462;&#xFF1F;</p>
<p><img src="../assets/images/a308123994f87a5ce99adc85dd9b4d01.jpg" alt=""></p>
<p>&#x6211;&#x4EEC;&#x5148;&#x7B80;&#x5355;&#x56DE;&#x987E;&#x4E00;&#x4E0B; <a href="https://time.geekbang.org/column/article/156849" target="_blank">[&#x7B2C; 07 &#x8BB2;]</a> &#x4ECB;&#x7ECD;&#x8FC7;&#x7684;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x3002;&#x5B83;&#x5305;&#x62EC;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x3001;&#x5E94;&#x7528;&#x5C42;&#x3001;&#x9886;&#x57DF;&#x5C42;&#x548C;&#x57FA;&#x7840;&#x5C42;&#xFF0C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x5404;&#x5C42;&#x7684;&#x804C;&#x8D23;&#x8FB9;&#x754C;&#x975E;&#x5E38;&#x6E05;&#x6670;&#xFF0C;&#x53C8;&#x80FD;&#x6709;&#x6761;&#x4E0D;&#x7D0A;&#x5730;&#x5206;&#x5C42;&#x534F;&#x4F5C;&#x3002;</p>
<ul>
<li>&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#xFF1A;&#x9762;&#x5411;&#x524D;&#x7AEF;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x9002;&#x914D;&#xFF0C;&#x9762;&#x5411;&#x8D44;&#x6E90;&#x5C42;&#x63D0;&#x4F9B;&#x8D44;&#x6E90;&#x9002;&#x914D;&#x3002;&#x8FD9;&#x4E00;&#x5C42;&#x805A;&#x96C6;&#x4E86;&#x63A5;&#x53E3;&#x9002;&#x914D;&#x76F8;&#x5173;&#x7684;&#x529F;&#x80FD;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x5C42;&#x804C;&#x8D23;&#xFF1A;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x7EC4;&#x5408;&#x548C;&#x7F16;&#x6392;&#xFF0C;&#x9002;&#x5E94;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x5FEB;&#x901F;&#x53D8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x3002;&#x8FD9;&#x4E00;&#x5C42;&#x805A;&#x96C6;&#x4E86;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x548C;&#x4E8B;&#x4EF6;&#x76F8;&#x5173;&#x7684;&#x529F;&#x80FD;&#x3002;</li>
<li>&#x9886;&#x57DF;&#x5C42;&#xFF1A;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;&#x8FD9;&#x4E00;&#x5C42;&#x805A;&#x96C6;&#x4E86;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x805A;&#x5408;&#x3001;&#x805A;&#x5408;&#x6839;&#x3001;&#x5B9E;&#x4F53;&#x3001;&#x503C;&#x5BF9;&#x8C61;&#x3001;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x548C;&#x4E8B;&#x4EF6;&#x7B49;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7EC4;&#x5408;&#x6240;&#x5F62;&#x6210;&#x7684;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x3002;</li>
<li>&#x57FA;&#x7840;&#x5C42;&#xFF1A;&#x8D2F;&#x7A7F;&#x6240;&#x6709;&#x5C42;&#xFF0C;&#x4E3A;&#x5404;&#x5C42;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E00;&#x5C42;&#x805A;&#x96C6;&#x4E86;&#x5404;&#x79CD;&#x5E95;&#x5C42;&#x8D44;&#x6E90;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#x548C;&#x80FD;&#x529B;&#x3002;</li>
</ul>
<p>&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4ECE;&#x9886;&#x57DF;&#x5C42;&#x3001;&#x5E94;&#x7528;&#x5C42;&#x5230;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x9010;&#x5C42;&#x5C01;&#x88C5;&#x548C;&#x534F;&#x4F5C;&#xFF0C;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x7075;&#x6D3B;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x65E2;&#x5B9E;&#x73B0;&#x4E86;&#x5404;&#x5C42;&#x7684;&#x5206;&#x5DE5;&#xFF0C;&#x53C8;&#x5B9E;&#x73B0;&#x4E86;&#x5404;&#x5C42;&#x7684;&#x534F;&#x4F5C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BCB;&#x5EB8;&#x7F6E;&#x7591;&#xFF0C;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x5C31;&#x662F;&#x8BBE;&#x8BA1;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x7684;&#x6700;&#x4F73;&#x4F9D;&#x636E;&#x3002;</p>
<h2 id="&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;">&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;</h2>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#xFF0C;&#x6309;&#x7167;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x5230;&#x5E95;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x5462;&#xFF1F;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;DDD&#x5E76;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x6807;&#x51C6;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7406;&#x89E3;&#x3002;&#x4E0B;&#x9762;&#x8981;&#x8BF4;&#x7684;&#x8FD9;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x662F;&#x6211;&#x7ECF;&#x8FC7;&#x601D;&#x8003;&#x548C;&#x5B9E;&#x8DF5;&#x540E;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x8FB9;&#x754C;&#x3001;&#x5206;&#x5C42;&#x4EE5;&#x53CA;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x3002;</p>
<h3 id="&#x5FAE;&#x670D;&#x52A1;&#x4E00;&#x7EA7;&#x76EE;&#x5F55;&#x7ED3;&#x6784;">&#x5FAE;&#x670D;&#x52A1;&#x4E00;&#x7EA7;&#x76EE;&#x5F55;&#x7ED3;&#x6784;</h3>
<p>&#x5FAE;&#x670D;&#x52A1;&#x4E00;&#x7EA7;&#x76EE;&#x5F55;&#x662F;&#x6309;&#x7167;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x5206;&#x5C42;&#x804C;&#x8D23;&#x6765;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x4ECE;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x91CC;&#x5206;&#x522B;&#x4E3A;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x3001;&#x5E94;&#x7528;&#x5C42;&#x3001;&#x9886;&#x57DF;&#x5C42;&#x548C;&#x57FA;&#x7840;&#x5C42;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E86; interfaces&#x3001;application&#x3001;domain &#x548C; infrastructure &#x56DB;&#x4E2A;&#x4E00;&#x7EA7;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x3002;</p>
<p><img src="../assets/images/d1bea7dc6bd93f3bd30ced821f36bb71.jpg" alt=""></p>
<p>&#x8FD9;&#x4E9B;&#x76EE;&#x5F55;&#x7684;&#x804C;&#x80FD;&#x548C;&#x4EE3;&#x7801;&#x5F62;&#x6001;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;</p>
<p><strong>Interfaces&#xFF08;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x4E0E;&#x524D;&#x7AEF;&#x4EA4;&#x4E92;&#x3001;&#x5C55;&#x73B0;&#x6570;&#x636E;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x901A;&#x8FC7;&#x8FD9;&#x4E00;&#x5C42;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5411;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x83B7;&#x53D6;&#x5C55;&#x73B0;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x4E00;&#x5C42;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x5904;&#x7406;&#x7528;&#x6237;&#x53D1;&#x9001;&#x7684;Restful&#x8BF7;&#x6C42;&#xFF0C;&#x89E3;&#x6790;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x9012;&#x7ED9;Application&#x5C42;&#x3002;&#x6570;&#x636E;&#x7684;&#x7EC4;&#x88C5;&#x3001;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x683C;&#x5F0F;&#x4EE5;&#x53CA;Facade&#x63A5;&#x53E3;&#x7B49;&#x4EE3;&#x7801;&#x90FD;&#x4F1A;&#x653E;&#x5728;&#x8FD9;&#x4E00;&#x5C42;&#x76EE;&#x5F55;&#x91CC;&#x3002;</p>
<p><strong>Application&#xFF08;&#x5E94;&#x7528;&#x5C42;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x5E94;&#x7528;&#x5C42;&#x670D;&#x52A1;&#x7EC4;&#x5408;&#x548C;&#x7F16;&#x6392;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5411;&#x4E0B;&#x57FA;&#x4E8E;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x7684;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x6216;&#x5916;&#x90E8;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x7684;&#x7F16;&#x6392;&#x548C;&#x7EC4;&#x5408;&#xFF0C;&#x5411;&#x4E0A;&#x4E3A;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x63D0;&#x4F9B;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x6570;&#x636E;&#x5C55;&#x73B0;&#x652F;&#x6301;&#x670D;&#x52A1;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x548C;&#x4E8B;&#x4EF6;&#x7B49;&#x4EE3;&#x7801;&#x4F1A;&#x653E;&#x5728;&#x8FD9;&#x4E00;&#x5C42;&#x76EE;&#x5F55;&#x91CC;&#x3002;</p>
<p><strong>Domain&#xFF08;&#x9886;&#x57DF;&#x5C42;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x9886;&#x57DF;&#x5C42;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x9886;&#x57DF;&#x5C42;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x805A;&#x5408;&#x4EE3;&#x7801;&#x5305;&#xFF0C;&#x5B83;&#x4EEC;&#x5171;&#x540C;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;&#x805A;&#x5408;&#x4EE5;&#x53CA;&#x805A;&#x5408;&#x5185;&#x7684;&#x5B9E;&#x4F53;&#x3001;&#x65B9;&#x6CD5;&#x3001;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x548C;&#x4E8B;&#x4EF6;&#x7B49;&#x4EE3;&#x7801;&#x4F1A;&#x653E;&#x5728;&#x8FD9;&#x4E00;&#x5C42;&#x76EE;&#x5F55;&#x91CC;&#x3002;</p>
<p><strong>Infrastructure&#xFF08;&#x57FA;&#x7840;&#x5C42;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x57FA;&#x7840;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E3A;&#x5176;&#x5B83;&#x5404;&#x5C42;&#x63D0;&#x4F9B;&#x7684;&#x901A;&#x7528;&#x6280;&#x672F;&#x80FD;&#x529B;&#x3001;&#x4E09;&#x65B9;&#x8F6F;&#x4EF6;&#x5305;&#x3001;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x3001;&#x914D;&#x7F6E;&#x548C;&#x57FA;&#x7840;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x4F1A;&#x653E;&#x5728;&#x8FD9;&#x4E00;&#x5C42;&#x76EE;&#x5F55;&#x91CC;&#x3002;</p>
<h3 id="&#x5404;&#x5C42;&#x76EE;&#x5F55;&#x7ED3;&#x6784;">&#x5404;&#x5C42;&#x76EE;&#x5F55;&#x7ED3;&#x6784;</h3>
<p><strong>1. &#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;</strong></p>
<p>Interfaces &#x7684;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x6709;&#xFF1A;assembler&#x3001;dto &#x548C; fa&#xE7;ade &#x4E09;&#x7C7B;&#x3002;</p>
<p><img src="../assets/images/c6ea040a520c91dfe6400f206ff36fef.jpg" alt=""></p>
<p><strong>Assembler&#xFF1A;</strong>&#x5B9E;&#x73B0;DTO&#x4E0E;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#x548C;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;Assembler&#x4E0E;DTO&#x603B;&#x662F;&#x4E00;&#x540C;&#x51FA;&#x73B0;&#x3002;</p>
<p><strong>Dto&#xFF1A;</strong>&#x5B83;&#x662F;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x5185;&#x90E8;&#x4E0D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;DTO&#x628A;&#x5185;&#x90E8;&#x7684;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x4E0E;&#x5916;&#x754C;&#x9694;&#x79BB;&#x3002;</p>
<p><strong>Facade&#xFF1A;</strong>&#x63D0;&#x4F9B;&#x8F83;&#x7C97;&#x7C92;&#x5EA6;&#x7684;&#x8C03;&#x7528;&#x63A5;&#x53E3;&#xFF0C;&#x5C06;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x59D4;&#x6D3E;&#x7ED9;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p><strong>2. &#x5E94;&#x7528;&#x5C42;</strong></p>
<p>Application &#x7684;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x6709;&#xFF1A;event &#x548C; service&#x3002;</p>
<p><img src="../assets/images/30caee3ceaf1085b7aa2cc388f996e61.jpg" alt=""></p>
<p><strong>Event&#xFF08;&#x4E8B;&#x4EF6;&#xFF09;&#xFF1A;</strong>&#x8FD9;&#x5C42;&#x76EE;&#x5F55;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x4E8B;&#x4EF6;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5B83;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#xFF1A;publish &#x548C; subscribe&#x3002;&#x524D;&#x8005;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x4E8B;&#x4EF6;&#x53D1;&#x5E03;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#xFF0C;&#x540E;&#x8005;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x4E8B;&#x4EF6;&#x8BA2;&#x9605;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#xFF08;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x76F8;&#x5173;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5728;&#x9886;&#x57DF;&#x5C42;&#x5B9E;&#x73B0;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x63D0;&#x793A;&#x4E00;&#x4E0B;&#xFF1A;&#x867D;&#x7136;&#x5E94;&#x7528;&#x5C42;&#x548C;&#x9886;&#x57DF;&#x5C42;&#x90FD;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x5E03;&#x548C;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x7684;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x5C06;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x6240;&#x6709;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x5E03;&#x548C;&#x8BA2;&#x9605;&#x7684;&#x5904;&#x7406;&#x90FD;&#x7EDF;&#x4E00;&#x653E;&#x5230;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x4E8B;&#x4EF6;&#x76F8;&#x5173;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5B9E;&#x73B0;&#x653E;&#x5728;&#x9886;&#x57DF;&#x5C42;&#x3002;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x5C42;&#x8C03;&#x7528;&#x9886;&#x57DF;&#x5C42;&#x670D;&#x52A1;&#xFF0C;&#x6765;&#x5B9E;&#x73B0;&#x5B8C;&#x6574;&#x7684;&#x4E8B;&#x4EF6;&#x53D1;&#x5E03;&#x548C;&#x8BA2;&#x9605;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x3002;</p>
<p><strong>Service&#xFF08;&#x5E94;&#x7528;&#x670D;&#x52A1;&#xFF09;&#xFF1A;</strong>&#x8FD9;&#x5C42;&#x7684;&#x670D;&#x52A1;&#x662F;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x4F1A;&#x5BF9;&#x591A;&#x4E2A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x6216;&#x5916;&#x90E8;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#x3001;&#x7F16;&#x6392;&#x548C;&#x7EC4;&#x5408;&#xFF0C;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x7C97;&#x7C92;&#x5EA6;&#x7684;&#x670D;&#x52A1;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x7EC4;&#x5408;&#x548C;&#x7F16;&#x6392;&#xFF0C;&#x662F;&#x4E00;&#x6BB5;&#x72EC;&#x7ACB;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x7C7B;&#x91CC;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8BBE;&#x8BA1;&#x4E3A;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x7C7B;&#xFF0C;&#x4EE5;&#x9632;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x7C7B;&#x4EE3;&#x7801;&#x91CF;&#x8FC7;&#x5927;&#x3002;</p>
<p><strong>3. &#x9886;&#x57DF;&#x5C42;</strong></p>
<p>Domain &#x662F;&#x7531;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x805A;&#x5408;&#x5305;&#x6784;&#x6210;&#xFF0C;&#x5171;&#x540C;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;&#x805A;&#x5408;&#x5185;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x662F;&#x6807;&#x51C6;&#x548C;&#x7EDF;&#x4E00;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;entity&#x3001;event&#x3001;repository &#x548C; service &#x56DB;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#x3002;</p>
<p><img src="../assets/images/688dd55b8399779baff8fc5b7c124c2c.jpg" alt=""></p>
<p>&#x800C;&#x9886;&#x57DF;&#x5C42;&#x805A;&#x5408;&#x5185;&#x90E8;&#x7684;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;</p>
<p><strong>Aggregate&#xFF08;&#x805A;&#x5408;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x662F;&#x805A;&#x5408;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x6839;&#x76EE;&#x5F55;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x7684;&#x805A;&#x5408;&#x540D;&#x79F0;&#x547D;&#x540D;&#xFF0C;&#x6BD4;&#x5982;&#x6743;&#x9650;&#x805A;&#x5408;&#x3002;&#x5728;&#x805A;&#x5408;&#x5185;&#x5B9A;&#x4E49;&#x805A;&#x5408;&#x6839;&#x3001;&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;&#x4EE5;&#x53CA;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x8FB9;&#x754C;&#x3002;&#x805A;&#x5408;&#x5185;&#x5B9E;&#x73B0;&#x9AD8;&#x5185;&#x805A;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x62C6;&#x5206;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x4EE5;&#x805A;&#x5408;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x4EE3;&#x7801;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5305;&#x91CC;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x4E1A;&#x52A1;&#x5185;&#x805A;&#xFF0C;&#x800C;&#x66F4;&#x5927;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x4EE5;&#x540E;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x805A;&#x5408;&#x7684;&#x91CD;&#x7EC4;&#x3002;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x6E05;&#x6670;&#x7684;&#x4EE3;&#x7801;&#x8FB9;&#x754C;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x8F7B;&#x677E;&#x5730;&#x5B9E;&#x73B0;&#x4EE5;&#x805A;&#x5408;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x91CD;&#x7EC4;&#xFF0C;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x4E2D;&#x6709;&#x7740;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<p><strong>Entity&#xFF08;&#x5B9E;&#x4F53;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x5B58;&#x653E;&#x805A;&#x5408;&#x6839;&#x3001;&#x5B9E;&#x4F53;&#x3001;&#x503C;&#x5BF9;&#x8C61;&#x4EE5;&#x53CA;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF08;Factory&#xFF09;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#x3002;&#x5B9E;&#x4F53;&#x7C7B;&#x91C7;&#x7528;&#x5145;&#x8840;&#x6A21;&#x578B;&#xFF0C;&#x540C;&#x4E00;&#x5B9E;&#x4F53;&#x76F8;&#x5173;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x90FD;&#x5728;&#x5B9E;&#x4F53;&#x7C7B;&#x4EE3;&#x7801;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;&#x8DE8;&#x5B9E;&#x4F53;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x5728;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;</p>
<p><strong>Event&#xFF08;&#x4E8B;&#x4EF6;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x5B58;&#x653E;&#x4E8B;&#x4EF6;&#x5B9E;&#x4F53;&#x4EE5;&#x53CA;&#x4E0E;&#x4E8B;&#x4EF6;&#x6D3B;&#x52A8;&#x76F8;&#x5173;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x3002;</p>
<p><strong>Service&#xFF08;&#x9886;&#x57DF;&#x670D;&#x52A1;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x5B58;&#x653E;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x3002;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x662F;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#x7EC4;&#x5408;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x6BB5;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x805A;&#x5408;&#x5185;&#x6240;&#x6709;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x90FD;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x7C7B;&#x4E2D;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x6BCF;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x8BBE;&#x8BA1;&#x4E3A;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;&#x5982;&#x679C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x5185;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x76F8;&#x5BF9;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x5C06;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x8BBE;&#x8BA1;&#x4E3A;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x7C7B;&#xFF0C;&#x907F;&#x514D;&#x7531;&#x4E8E;&#x6240;&#x6709;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x90FD;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x7C7B;&#x4E2D;&#xFF0C;&#x800C;&#x51FA;&#x73B0;&#x4EE3;&#x7801;&#x81C3;&#x80BF;&#x7684;&#x95EE;&#x9898;&#x3002;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x5C01;&#x88C5;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#x6216;&#x65B9;&#x6CD5;&#x540E;&#x5411;&#x4E0A;&#x5C42;&#x63D0;&#x4F9B;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x3002;</p>
<p><strong>Repository&#xFF08;&#x4ED3;&#x50A8;&#xFF09;&#xFF1A;</strong>&#x5B83;&#x5B58;&#x653E;&#x6240;&#x5728;&#x805A;&#x5408;&#x7684;&#x67E5;&#x8BE2;&#x6216;&#x6301;&#x4E45;&#x5316;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x4ED3;&#x50A8;&#x63A5;&#x53E3;&#x548C;&#x4ED3;&#x50A8;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x805A;&#x5408;&#x7684;&#x62C6;&#x5206;&#x548C;&#x7EC4;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x8BBE;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#xFF1A;&#x4E00;&#x4E2A;&#x805A;&#x5408;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x4ED3;&#x50A8;&#x3002;</p>
<p>&#x7279;&#x522B;&#x8BF4;&#x660E;&#xFF1A;&#x6309;&#x7167;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x4ED3;&#x50A8;&#x5B9E;&#x73B0;&#x672C;&#x5E94;&#x8BE5;&#x5C5E;&#x4E8E;&#x57FA;&#x7840;&#x5C42;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x65F6;&#xFF0C;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x62C6;&#x5206;&#x548C;&#x91CD;&#x7EC4;&#x7684;&#x4FBF;&#x5229;&#x6027;&#xFF0C;&#x6211;&#x662F;&#x628A;&#x805A;&#x5408;&#x4ED3;&#x50A8;&#x5B9E;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#x653E;&#x5230;&#x4E86;&#x805A;&#x5408;&#x5305;&#x5185;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x6C42;&#x6216;&#x8005;&#x8BBE;&#x8BA1;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x5BFC;&#x81F4;&#x805A;&#x5408;&#x9700;&#x8981;&#x62C6;&#x5206;&#x6216;&#x91CD;&#x7EC4;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x5305;&#x62EC;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x548C;&#x4ED3;&#x50A8;&#x4EE3;&#x7801;&#x7684;&#x805A;&#x5408;&#x5305;&#x6574;&#x4F53;&#x8FC1;&#x79FB;&#xFF0C;&#x8F7B;&#x677E;&#x5B9E;&#x73B0;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x3002;</p>
<p><strong>4. &#x57FA;&#x7840;&#x5C42;</strong></p>
<p>Infrastructure &#x7684;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x6709;&#xFF1A;config &#x548C; util &#x4E24;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#x3002;</p>
<p><img src="../assets/images/5bbe3454e2ecf4ff4770e887a4967b5a.jpg" alt=""></p>
<p><strong>Config&#xFF1A;</strong>&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x914D;&#x7F6E;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#x3002;</p>
<p><strong>Util&#xFF1A;</strong>&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x5E73;&#x53F0;&#x3001;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x3001;&#x6D88;&#x606F;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x7F13;&#x5B58;&#x3001;&#x6587;&#x4EF6;&#x3001;&#x603B;&#x7EBF;&#x3001;&#x7F51;&#x5173;&#x3001;&#x7B2C;&#x4E09;&#x65B9;&#x7C7B;&#x5E93;&#x3001;&#x901A;&#x7528;&#x7B97;&#x6CD5;&#x7B49;&#x57FA;&#x7840;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x8D44;&#x6E90;&#x7C7B;&#x522B;&#x5EFA;&#x7ACB;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x76EE;&#x5F55;&#x3002;</p>
<h3 id="&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x603B;&#x76EE;&#x5F55;&#x7ED3;&#x6784;">&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x603B;&#x76EE;&#x5F55;&#x7ED3;&#x6784;</h3>
<p>&#x5728;&#x5B8C;&#x6210;&#x4E00;&#x7EA7;&#x548C;&#x4E8C;&#x7EA7;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x8BBE;&#x8BA1;&#x540E;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0B;&#x56FE;&#x8FD9;&#x6837;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x7684;&#x603B;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x4E86;&#x3002;</p>
<p><img src="../assets/images/915ad8d830d925a893cd09ff6cbdadb8.jpg" alt=""></p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x6839;&#x636E;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x5EFA;&#x7ACB;&#x4E86;&#x6807;&#x51C6;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x91CC;&#x9762;&#xFF0C;&#x5404;&#x4EE3;&#x7801;&#x5BF9;&#x8C61;&#x5404;&#x636E;&#x5176;&#x4F4D;&#x3001;&#x5404;&#x53F8;&#x5176;&#x804C;&#xFF0C;&#x5171;&#x540C;&#x534F;&#x4F5C;&#x5B8C;&#x6210;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</p>
<p>&#x90A3;&#x5173;&#x4E8E;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x6211;&#x8FD8;&#x9700;&#x8981;&#x5F3A;&#x8C03;&#x4E24;&#x70B9;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x70B9;&#xFF1A;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x4EE3;&#x7801;&#x8FB9;&#x754C;&#x4E00;&#x5B9A;&#x8981;&#x6E05;&#x6670;&#x3002;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x548C;&#x6570;&#x636E;&#x5173;&#x8054;&#x5E94;&#x8BE5;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x677E;&#x8026;&#x5408;&#x548C;&#x4F4E;&#x5173;&#x8054;&#xFF0C;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x4E0A;&#x5C42;&#x7684;&#x5E94;&#x7528;&#x5C42;&#x7EC4;&#x5408;&#x5B9E;&#x73B0;&#x8C03;&#x7528;&#xFF0C;&#x539F;&#x5219;&#x4E0A;&#x4E0D;&#x5141;&#x8BB8;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x79CD;&#x677E;&#x8026;&#x5408;&#x7684;&#x4EE3;&#x7801;&#x5173;&#x8054;&#xFF0C;&#x5728;&#x4EE5;&#x540E;&#x4E1A;&#x52A1;&#x53D1;&#x5C55;&#x548C;&#x9700;&#x6C42;&#x53D8;&#x66F4;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x5730;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x548C;&#x805A;&#x5408;&#x4EE3;&#x7801;&#x7684;&#x91CD;&#x7EC4;&#xFF0C;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x4E2D;&#x5C06;&#x4F1A;&#x8D77;&#x5230;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x70B9;&#xFF1A;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x4EE3;&#x7801;&#x5206;&#x5C42;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x4E00;&#x5B9A;&#x8981;&#x641E;&#x6E05;&#x695A;&#x4EE3;&#x7801;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x5C06;&#x5B83;&#x653E;&#x5728;&#x804C;&#x8D23;&#x5BF9;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x5185;&#x3002;&#x5E94;&#x7528;&#x5C42;&#x4EE3;&#x7801;&#x4E3B;&#x8981;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x7EC4;&#x5408;&#x548C;&#x7F16;&#x6392;&#xFF0C;&#x4EE5;&#x53CA;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#xFF0C;&#x5B83;&#x662F;&#x5F88;&#x8584;&#x7684;&#x4E00;&#x5C42;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x6838;&#x5FC3;&#x9886;&#x57DF;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x3002;&#x9886;&#x57DF;&#x5C42;&#x662F;&#x4E1A;&#x52A1;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x6838;&#x5FC3;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x4E00;&#x5B9A;&#x8981;&#x5728;&#x9886;&#x57DF;&#x5C42;&#x5B9E;&#x73B0;&#x3002;&#x5982;&#x679C;&#x5C06;&#x6838;&#x5FC3;&#x9886;&#x57DF;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#x653E;&#x5230;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x4F60;&#x7684;&#x57FA;&#x4E8E;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x6162;&#x6162;&#x5C31;&#x4F1A;&#x6F14;&#x53D8;&#x6210;&#x4F20;&#x7EDF;&#x7684;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x4E86;&#x3002;</p>
<h2 id="&#x601D;&#x8003;&#x9898;">&#x601D;&#x8003;&#x9898;</h2>
<p>&#x5BF9;&#x6BD4;&#x4E00;&#x4E0B;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x548C;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x7684;&#x5DEE;&#x5F02;&#xFF1F;</p>
<p>&#x671F;&#x5F85;&#x4F60;&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x540C;&#x4EA4;&#x6D41;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="163961.html" class="navigation navigation-prev " aria-label="Previous page: 12 | 领域建模：如何用事件风暴构建领域模型？">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="166147.html" class="navigation navigation-next " aria-label="Next page: 14 | 代码模型（下）：如何保证领域模型与代码模型的一致性？">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"13 | 代码模型（上）：如何使用DDD设计微服务代码模型？","level":"5.3","depth":1,"next":{"title":"14 | 代码模型（下）：如何保证领域模型与代码模型的一致性？","level":"5.4","depth":1,"path":"docs/166147.md","ref":"./docs/166147.md","articles":[]},"previous":{"title":"12 | 领域建模：如何用事件风暴构建领域模型？","level":"5.2","depth":1,"path":"docs/163961.md","ref":"./docs/163961.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"DDD实战课","language":"zh","gitbook":"*"},"file":{"path":"docs/165248.md","mtime":"2025-10-30T15:15:56.223Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2025-10-30T15:16:49.471Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

