
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>16 | 视图：如何实现服务和数据在微服务各层的协作？ · DDD实战课</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="169017.html" />
    
    
    <link rel="prev" href="166635.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">开篇词</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="149941.html">
            
                <a href="149941.html">
            
                    
                    开篇词 | 学好了DDD，你能做什么？
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基础篇</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="149943.html">
            
                <a href="149943.html">
            
                    
                    01 | 领域驱动设计：微服务设计为什么要选择DDD？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="149945.html">
            
                <a href="149945.html">
            
                    
                    02 | 领域、子域、核心域、通用域和支撑域：傻傻分不清？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="149950.html">
            
                <a href="149950.html">
            
                    
                    03 | 限界上下文：定义领域边界的利器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="152677.html">
            
                <a href="152677.html">
            
                    
                    04 | 实体和值对象：从领域模型的基础单元看系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="154547.html">
            
                <a href="154547.html">
            
                    
                    05 | 聚合和聚合根：怎样设计聚合？
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">进阶篇</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="155444.html">
            
                <a href="155444.html">
            
                    
                    06 | 领域事件：解耦微服务的关键
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="156849.html">
            
                <a href="156849.html">
            
                    
                    07 | DDD分层架构：有效降低层与层之间的依赖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="158248.html">
            
                <a href="158248.html">
            
                    
                    08 | 微服务架构模型：几种常见模型的对比和分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="159580.html">
            
                <a href="159580.html">
            
                    
                    09 | 中台：数字转型后到底应该共享什么？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.5" data-path="161004.html">
            
                <a href="161004.html">
            
                    
                    10 | DDD、中台和微服务：它们是如何协作的？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.6" data-path="161888.html">
            
                <a href="161888.html">
            
                    
                    答疑：有关3个典型问题的讲解
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">实战篇</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="163032.html">
            
                <a href="163032.html">
            
                    
                    11 | DDD实践：如何用DDD重构中台业务模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="163961.html">
            
                <a href="163961.html">
            
                    
                    12 | 领域建模：如何用事件风暴构建领域模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="165248.html">
            
                <a href="165248.html">
            
                    
                    13 | 代码模型（上）：如何使用DDD设计微服务代码模型？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.4" data-path="166147.html">
            
                <a href="166147.html">
            
                    
                    14 | 代码模型（下）：如何保证领域模型与代码模型的一致性？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.5" data-path="166635.html">
            
                <a href="166635.html">
            
                    
                    15 | 边界：微服务的各种边界在架构演进中的作用？
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="5.6" data-path="167710.html">
            
                <a href="167710.html">
            
                    
                    16 | 视图：如何实现服务和数据在微服务各层的协作？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.7" data-path="169017.html">
            
                <a href="169017.html">
            
                    
                    17 | 从后端到前端：微服务后，前端如何设计？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.8" data-path="169881.html">
            
                <a href="169881.html">
            
                    
                    18 | 知识点串讲：基于DDD的微服务设计实例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.9" data-path="171185.html">
            
                <a href="171185.html">
            
                    
                    19 | 总结（一）：微服务设计和拆分要坚持哪些原则？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.10" data-path="172300.html">
            
                <a href="172300.html">
            
                    
                    20 | 总结（二）：分布式架构关键设计10问
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">结束语</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="172730.html">
            
                <a href="172730.html">
            
                    
                    结束语 | 所谓高手，就是跨过坑和大海！
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">专栏加餐</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="185174.html">
            
                <a href="185174.html">
            
                    
                    基于DDD的微服务设计实例代码详解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="307617.html">
            
                <a href="307617.html">
            
                    
                    抽奖｜《DDD实战课》沉淀成书了，感谢有你！
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">期末测试</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="239046.html">
            
                <a href="239046.html">
            
                    
                    期末测试 | 有关DDD的内容，你掌握了多少呢？
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >16 | 视图：如何实现服务和数据在微服务各层的协作？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="16--&#x89C6;&#x56FE;&#xFF1A;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x548C;&#x6570;&#x636E;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x5404;&#x5C42;&#x7684;&#x534F;&#x4F5C;&#xFF1F;">16 | &#x89C6;&#x56FE;&#xFF1A;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x548C;&#x6570;&#x636E;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x5404;&#x5C42;&#x7684;&#x534F;&#x4F5C;&#xFF1F;</h1>
<blockquote>
<p>&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x6B27;&#x521B;&#x65B0;&#x3002;</p>
</blockquote>
<p>&#x5728;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5C06;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x5206;&#x5C42;&#xFF0C;&#x5B9A;&#x4E49;&#x4E86;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x5BF9;&#x8C61;&#x548C;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x3002;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x786E;&#x5B9A;&#x4E86;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x603B;&#x4F53;&#x67B6;&#x6784;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x7684;&#x4E3B;&#x8981;&#x5BF9;&#x8C61;&#x6709;&#x670D;&#x52A1;&#x548C;&#x5B9E;&#x4F53;&#x7B49;&#xFF0C;&#x5B83;&#x4EEC;&#x4E00;&#x8D77;&#x534F;&#x4F5C;&#x5B8C;&#x6210;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</p>
<p>&#x90A3;&#x5728;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x548C;&#x5B9E;&#x4F53;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x5404;&#x5C42;&#x662F;&#x5982;&#x4F55;&#x534F;&#x4F5C;&#x7684;&#x5462;&#xFF1F;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x89E3;&#x5256;&#x4E00;&#x4E0B;&#x57FA;&#x4E8E;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x770B;&#x770B;&#x5B83;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x3002;</p>
<h2 id="&#x670D;&#x52A1;&#x7684;&#x534F;&#x4F5C;">&#x670D;&#x52A1;&#x7684;&#x534F;&#x4F5C;</h2>
<h3 id="1-&#x670D;&#x52A1;&#x7684;&#x7C7B;&#x578B;">1. &#x670D;&#x52A1;&#x7684;&#x7C7B;&#x578B;</h3>
<p>&#x6211;&#x4EEC;&#x5148;&#x6765;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#x7684;&#x670D;&#x52A1;&#x3002;&#x6309;&#x7167;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x5176;&#x5185;&#x90E8;&#x6709;Facade&#x670D;&#x52A1;&#x3001;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3001;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x548C;&#x57FA;&#x7840;&#x670D;&#x52A1;&#x3002;&#x5404;&#x5C42;&#x670D;&#x52A1;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x548C;&#x804C;&#x8D23;&#x5982;&#x4E0B;&#x3002;</p>
<p><strong>Facade&#x670D;&#x52A1;&#xFF1A;</strong>&#x4F4D;&#x4E8E;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#xFF0C;&#x5305;&#x62EC;&#x63A5;&#x53E3;&#x548C;&#x5B9E;&#x73B0;&#x4E24;&#x90E8;&#x5206;&#x3002;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x7528;&#x6237;&#x53D1;&#x9001;&#x7684;Restful&#x8BF7;&#x6C42;&#x548C;&#x89E3;&#x6790;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7B49;&#xFF0C;&#x5E76;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x9012;&#x7ED9;&#x5E94;&#x7528;&#x5C42;&#x3002;&#x6216;&#x8005;&#x5728;&#x83B7;&#x53D6;&#x5230;&#x5E94;&#x7528;&#x5C42;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x5C06;DO&#x7EC4;&#x88C5;&#x6210;DTO&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x5230;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x3002;</p>
<p><strong>&#x5E94;&#x7528;&#x670D;&#x52A1;&#xFF1A;</strong>&#x4F4D;&#x4E8E;&#x5E94;&#x7528;&#x5C42;&#x3002;&#x7528;&#x6765;&#x8868;&#x8FF0;&#x5E94;&#x7528;&#x548C;&#x7528;&#x6237;&#x884C;&#x4E3A;&#xFF0C;&#x8D1F;&#x8D23;&#x670D;&#x52A1;&#x7684;&#x7EC4;&#x5408;&#x3001;&#x7F16;&#x6392;&#x548C;&#x8F6C;&#x53D1;&#xFF0C;&#x8D1F;&#x8D23;&#x5904;&#x7406;&#x4E1A;&#x52A1;&#x7528;&#x4F8B;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x4EE5;&#x53CA;&#x7ED3;&#x679C;&#x62FC;&#x88C5;&#xFF0C;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x7C97;&#x7C92;&#x5EA6;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<p><strong>&#x9886;&#x57DF;&#x670D;&#x52A1;&#xFF1A;</strong>&#x4F4D;&#x4E8E;&#x9886;&#x57DF;&#x5C42;&#x3002;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x5C01;&#x88C5;&#x6838;&#x5FC3;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x5B9E;&#x73B0;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#x534F;&#x4F5C;&#x7684;&#x6838;&#x5FC3;&#x9886;&#x57DF;&#x903B;&#x8F91;&#x3002;&#x5B83;&#x5BF9;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#x6216;&#x65B9;&#x6CD5;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#x6216;&#x7F16;&#x6392;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x4E25;&#x683C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#x5BF9;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x5C01;&#x88C5;&#xFF0C;&#x4EE5;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x7684;&#x65B9;&#x5F0F;&#x4F9B;&#x5E94;&#x7528;&#x5C42;&#x8C03;&#x7528;&#x3002;</p>
<p><strong>&#x57FA;&#x7840;&#x670D;&#x52A1;&#xFF1A;</strong>&#x4F4D;&#x4E8E;&#x57FA;&#x7840;&#x5C42;&#x3002;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#xFF08;&#x6BD4;&#x5982;&#x6570;&#x636E;&#x5E93;&#x3001;&#x7F13;&#x5B58;&#x7B49;&#xFF09;&#xFF0C;&#x5B9E;&#x73B0;&#x5404;&#x5C42;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x964D;&#x4F4E;&#x5916;&#x90E8;&#x8D44;&#x6E90;&#x53D8;&#x5316;&#x5BF9;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#x903B;&#x8F91;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x57FA;&#x7840;&#x670D;&#x52A1;&#x4E3B;&#x8981;&#x4E3A;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#xFF0C;&#x901A;&#x8FC7;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x3002;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x548C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x90FD;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#x63A5;&#x53E3;&#xFF0C;&#x901A;&#x8FC7;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x3002;</p>
<h3 id="2-&#x670D;&#x52A1;&#x7684;&#x8C03;&#x7528;">2. &#x670D;&#x52A1;&#x7684;&#x8C03;&#x7528;</h3>
<p>&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#x3002;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x5305;&#x62EC;&#x4E09;&#x7C7B;&#x4E3B;&#x8981;&#x573A;&#x666F;&#xFF1A;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x8DE8;&#x5C42;&#x670D;&#x52A1;&#x8C03;&#x7528;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x548C;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x3002;</p>
<p><img src="../assets/images/e5d025a6fd69d1f2cf2a1af53253abdb.png" alt=""></p>
<p><strong>&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x8DE8;&#x5C42;&#x670D;&#x52A1;&#x8C03;&#x7528;</strong></p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x4E0B;&#x5F80;&#x5F80;&#x91C7;&#x7528;&#x524D;&#x540E;&#x7AEF;&#x5206;&#x79BB;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x3002;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x8C03;&#x7528;&#x53D1;&#x5E03;&#x5728;API&#x7F51;&#x5173;&#x4E0A;&#x7684;Facade&#x670D;&#x52A1;&#xFF0C;Facade&#x5B9A;&#x5411;&#x5230;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x7EC4;&#x7EC7;&#x548C;&#x7F16;&#x6392;&#x8005;&#xFF0C;&#x5B83;&#x7684;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x6709;&#x8FD9;&#x6837;&#x4E24;&#x79CD;&#x8DEF;&#x5F84;&#xFF1A;</p>
<ul>
<li>&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x5E76;&#x7EC4;&#x88C5;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x3002;&#x6B64;&#x65F6;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4F1A;&#x7EC4;&#x88C5;&#x5B9E;&#x4F53;&#x548C;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#xFF0C;&#x5B9E;&#x73B0;&#x6838;&#x5FC3;&#x9886;&#x57DF;&#x903B;&#x8F91;&#x3002;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x901A;&#x8FC7;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#x83B7;&#x53D6;&#x6301;&#x4E45;&#x5316;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF0C;&#x5B8C;&#x6210;&#x5B9E;&#x4F53;&#x6570;&#x636E;&#x521D;&#x59CB;&#x5316;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x50CF;&#x7F13;&#x5B58;&#x3001;&#x6587;&#x4EF6;&#x7B49;&#x7C7B;&#x578B;&#x7684;&#x57FA;&#x7840;&#x5C42;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x3002;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x4E3B;&#x8981;&#x662F;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#xFF0C;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7684;&#x9886;&#x57DF;&#x903B;&#x8F91;&#xFF0C;&#x4E0D;&#x7ECF;&#x8FC7;&#x9886;&#x57DF;&#x5C42;&#xFF0C;&#x4E0D;&#x6D89;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x6301;&#x4E45;&#x5316;&#x5BF9;&#x8C61;&#x3002;</li>
</ul>
<p><strong>&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x670D;&#x52A1;&#x8C03;&#x7528;</strong></p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;API&#x7F51;&#x5173;&#x8BBF;&#x95EE;&#x3002;&#x7531;&#x4E8E;&#x8DE8;&#x5FAE;&#x670D;&#x52A1;&#x64CD;&#x4F5C;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x65B0;&#x589E;&#x548C;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x5173;&#x6CE8;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF0C;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p><strong>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;</strong></p>
<p>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x5305;&#x62EC;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4E8B;&#x4EF6;&#xFF08;&#x8BE6;&#x89C1; <a href="https://time.geekbang.org/column/article/155444" target="_blank">[&#x7B2C; 06 &#x8BB2;]</a>&#xFF09;&#x3002;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#x603B;&#x7EBF;&#xFF08;EventBus&#xFF09;&#x5B8C;&#x6210;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x5F02;&#x6B65;&#x5904;&#x7406;&#x3002;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x5B8C;&#x6210;&#x3002;&#x5F02;&#x6B65;&#x5316;&#x7684;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x673A;&#x5236;&#x662F;&#x4E00;&#x79CD;&#x95F4;&#x63A5;&#x7684;&#x670D;&#x52A1;&#x8BBF;&#x95EE;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5F53;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5904;&#x7406;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x751F;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#xFF0C;&#x53EF;&#x8C03;&#x7528;&#x4E8B;&#x4EF6;&#x53D1;&#x5E03;&#x670D;&#x52A1;&#xFF0C;&#x5B8C;&#x6210;&#x4E8B;&#x4EF6;&#x53D1;&#x5E03;&#x3002;</p>
<p>&#x5F53;&#x63A5;&#x6536;&#x5230;&#x8BA2;&#x9605;&#x7684;&#x4E3B;&#x9898;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4E8B;&#x4EF6;&#x8BA2;&#x9605;&#x670D;&#x52A1;&#x4F1A;&#x8C03;&#x7528;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x9886;&#x57DF;&#x670D;&#x52A1;&#xFF0C;&#x5B8C;&#x6210;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x4E1A;&#x52A1;&#x64CD;&#x4F5C;&#x3002;</p>
<h3 id="3-&#x670D;&#x52A1;&#x7684;&#x5C01;&#x88C5;&#x4E0E;&#x7EC4;&#x5408;">3. &#x670D;&#x52A1;&#x7684;&#x5C01;&#x88C5;&#x4E0E;&#x7EC4;&#x5408;</h3>
<p>&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#x3002;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x670D;&#x52A1;&#x662F;&#x4ECE;&#x9886;&#x57DF;&#x5C42;&#x9010;&#x7EA7;&#x5411;&#x4E0A;&#x5C01;&#x88C5;&#x3001;&#x7EC4;&#x5408;&#x548C;&#x66B4;&#x9732;&#x7684;&#x3002;</p>
<p><img src="../assets/images/2d6a328a9fd8b4b3906bb9f59435ca1d.png" alt=""></p>
<p><strong>&#x57FA;&#x7840;&#x5C42;</strong></p>
<p>&#x57FA;&#x7840;&#x5C42;&#x7684;&#x670D;&#x52A1;&#x5F62;&#x6001;&#x4E3B;&#x8981;&#x662F;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#x3002;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#x5305;&#x62EC;&#x63A5;&#x53E3;&#x548C;&#x5B9E;&#x73B0;&#x4E24;&#x90E8;&#x5206;&#x3002;&#x4ED3;&#x50A8;&#x63A5;&#x53E3;&#x670D;&#x52A1;&#x4F9B;&#x5E94;&#x7528;&#x5C42;&#x6216;&#x8005;&#x9886;&#x57DF;&#x5C42;&#x670D;&#x52A1;&#x8C03;&#x7528;&#xFF0C;&#x4ED3;&#x50A8;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#xFF0C;&#x5B8C;&#x6210;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x7684;&#x6301;&#x4E45;&#x5316;&#x6216;&#x6570;&#x636E;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<p><strong>&#x9886;&#x57DF;&#x5C42;</strong></p>
<p>&#x9886;&#x57DF;&#x5C42;&#x5B9E;&#x73B0;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x8D1F;&#x8D23;&#x8868;&#x8FBE;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E1A;&#x52A1;&#x6982;&#x5FF5;&#x3001;&#x4E1A;&#x52A1;&#x72B6;&#x6001;&#x548C;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#x3002;&#x4E3B;&#x8981;&#x7684;&#x670D;&#x52A1;&#x5F62;&#x6001;&#x6709;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x548C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5B9E;&#x4F53;&#x91C7;&#x7528;&#x5145;&#x8840;&#x6A21;&#x578B;&#xFF0C;&#x5728;&#x5B9E;&#x4F53;&#x7C7B;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x5B9E;&#x4F53;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x5B9E;&#x73B0;&#x7684;&#x5F62;&#x5F0F;&#x662F;&#x5B9E;&#x4F53;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5B9E;&#x4F53;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x539F;&#x5B50;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5355;&#x5143;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x65F6;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x5B9E;&#x4F53;&#x81EA;&#x8EAB;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x4E1A;&#x52A1;&#x884C;&#x4E3A;&#xFF0C;&#x5B9E;&#x73B0;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x6838;&#x5FC3;&#x57FA;&#x7840;&#x80FD;&#x529B;&#x3002;&#x4E0D;&#x5FC5;&#x8FC7;&#x591A;&#x8003;&#x8651;&#x5916;&#x90E8;&#x64CD;&#x4F5C;&#x548C;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3002;</p>
<p>DDD&#x63D0;&#x5021;&#x5BCC;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x5C3D;&#x91CF;&#x5C06;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5F52;&#x5C5E;&#x5230;&#x5B9E;&#x4F53;&#x5BF9;&#x8C61;&#x4E0A;&#xFF0C;&#x5B9E;&#x5728;&#x65E0;&#x6CD5;&#x5F52;&#x5C5E;&#x7684;&#x90E8;&#x5206;&#x5219;&#x8BBE;&#x8BA1;&#x6210;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x3002;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x4F1A;&#x5BF9;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#x6216;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x7EC4;&#x88C5;&#x548C;&#x7F16;&#x6392;&#xFF0C;&#x5B9E;&#x73B0;&#x8DE8;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#x7684;&#x590D;&#x6742;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E25;&#x683C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x5982;&#x679C;&#x5355;&#x4E2A;&#x5B9E;&#x4F53;&#x7684;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x5BF9;&#x5E94;&#x7528;&#x5C42;&#x66B4;&#x9732;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x5C01;&#x88C5;&#x540E;&#x624D;&#x80FD;&#x66B4;&#x9732;&#x7ED9;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3002;</p>
<p><strong>&#x5E94;&#x7528;&#x5C42;</strong></p>
<p>&#x5E94;&#x7528;&#x5C42;&#x7528;&#x6765;&#x8868;&#x8FF0;&#x5E94;&#x7528;&#x548C;&#x7528;&#x6237;&#x884C;&#x4E3A;&#xFF0C;&#x8D1F;&#x8D23;&#x670D;&#x52A1;&#x7684;&#x7EC4;&#x5408;&#x3001;&#x7F16;&#x6392;&#x548C;&#x8F6C;&#x53D1;&#xFF0C;&#x8D1F;&#x8D23;&#x5904;&#x7406;&#x4E1A;&#x52A1;&#x7528;&#x4F8B;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x4EE5;&#x53CA;&#x7ED3;&#x679C;&#x7684;&#x62FC;&#x88C5;&#xFF0C;&#x8D1F;&#x8D23;&#x4E0D;&#x540C;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x670D;&#x52A1;&#x548C;&#x6570;&#x636E;&#x534F;&#x8C03;&#xFF0C;&#x8D1F;&#x8D23;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4E8B;&#x4EF6;&#x53D1;&#x5E03;&#x548C;&#x8BA2;&#x9605;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5BF9;&#x5916;&#x66B4;&#x9732;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5185;&#x90E8;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x9690;&#x85CF;&#x9886;&#x57DF;&#x5C42;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x590D;&#x6742;&#x6027;&#x4EE5;&#x53CA;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#x3002;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x4E3B;&#x8981;&#x670D;&#x52A1;&#x5F62;&#x6001;&#x6709;&#xFF1A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3001;&#x4E8B;&#x4EF6;&#x53D1;&#x5E03;&#x548C;&#x8BA2;&#x9605;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5185;&#x7528;&#x4E8E;&#x7EC4;&#x5408;&#x548C;&#x7F16;&#x6392;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x4E8E;&#x9886;&#x57DF;&#x670D;&#x52A1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5916;&#x90E8;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3002;&#x9664;&#x4E86;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x7684;&#x7EC4;&#x5408;&#x548C;&#x7F16;&#x6392;&#x5916;&#xFF0C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5185;&#x8FD8;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5B89;&#x5168;&#x8BA4;&#x8BC1;&#x3001;&#x6743;&#x9650;&#x6821;&#x9A8C;&#x3001;&#x521D;&#x6B65;&#x7684;&#x6570;&#x636E;&#x6821;&#x9A8C;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x63A7;&#x5236;&#x7B49;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x548C;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x5E94;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x539F;&#x5219;&#x4E0A;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x7981;&#x6B62;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x548C;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x8868;&#x5173;&#x8054;&#x3002;</p>
<p><strong>&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;</strong></p>
<p>&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x662F;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x548C;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x670D;&#x52A1;&#x8BBF;&#x95EE;&#x548C;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x7684;&#x6865;&#x6881;&#x3002;&#x5B83;&#x5904;&#x7406;&#x524D;&#x7AEF;&#x53D1;&#x9001;&#x7684;Restful&#x8BF7;&#x6C42;&#x548C;&#x89E3;&#x6790;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7B49;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x9012;&#x7ED9;&#x5E94;&#x7528;&#x5C42;&#x3002;&#x6216;&#x83B7;&#x53D6;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x7684;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x7EC4;&#x88C5;&#xFF0C;&#x5411;&#x524D;&#x7AEF;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x670D;&#x52A1;&#x3002;&#x4E3B;&#x8981;&#x670D;&#x52A1;&#x5F62;&#x6001;&#x662F;Facade&#x670D;&#x52A1;&#x3002;</p>
<p>Facade&#x670D;&#x52A1;&#x5206;&#x4E3A;&#x63A5;&#x53E3;&#x548C;&#x5B9E;&#x73B0;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x5B9A;&#x5411;&#xFF0C;DO&#x4E0E;DTO&#x6570;&#x636E;&#x7684;&#x8F6C;&#x6362;&#x548C;&#x7EC4;&#x88C5;&#xFF0C;&#x5B9E;&#x73B0;&#x524D;&#x7AEF;&#x4E0E;&#x5E94;&#x7528;&#x5C42;&#x6570;&#x636E;&#x7684;&#x8F6C;&#x6362;&#x548C;&#x4EA4;&#x6362;&#x3002;</p>
<h3 id="4-&#x4E24;&#x79CD;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x670D;&#x52A1;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;">4. &#x4E24;&#x79CD;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x670D;&#x52A1;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;</h3>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x56DE;&#x987E;&#x4E00;&#x4E0B;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x539F;&#x5219;&#x5C31;&#x662F;&#xFF1A;&#x6BCF;&#x5C42;&#x53EA;&#x80FD;&#x4E0E;&#x4F4D;&#x4E8E;&#x5176;&#x4E0B;&#x65B9;&#x7684;&#x5C42;&#x53D1;&#x751F;&#x8026;&#x5408;&#x3002;</p>
<p>&#x90A3;&#x6839;&#x636E;&#x8026;&#x5408;&#x7684;&#x7D27;&#x5BC6;&#x7A0B;&#x5EA6;&#xFF0C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#xFF1A;&#x4E25;&#x683C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x548C;&#x677E;&#x6563;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x3002;&#x5728;&#x4E25;&#x683C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;&#x5C42;&#x53EA;&#x80FD;&#x4E0E;&#x4F4D;&#x4E8E;&#x5176;&#x76F4;&#x63A5;&#x4E0B;&#x65B9;&#x7684;&#x5C42;&#x53D1;&#x751F;&#x4F9D;&#x8D56;&#x3002;&#x5728;&#x677E;&#x6563;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;&#x5C42;&#x53EF;&#x4EE5;&#x4E0E;&#x5176;&#x4EFB;&#x610F;&#x4E0B;&#x65B9;&#x7684;&#x5C42;&#x53D1;&#x751F;&#x4F9D;&#x8D56;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x548C;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x8FD9;&#x4E24;&#x79CD;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x3002;</p>
<p><strong>&#x677E;&#x6563;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x670D;&#x52A1;&#x4F9D;&#x8D56;</strong></p>
<p>&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x5728;&#x677E;&#x6563;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x9886;&#x57DF;&#x5C42;&#x7684;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x548C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x66B4;&#x9732;&#x7ED9;&#x5E94;&#x7528;&#x5C42;&#x548C;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x3002;&#x677E;&#x6563;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x670D;&#x52A1;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x65E0;&#x9700;&#x9010;&#x7EA7;&#x5C01;&#x88C5;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x66B4;&#x9732;&#x7ED9;&#x4E0A;&#x5C42;&#x3002;</p>
<p>&#x4F46;&#x5B83;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x5BB9;&#x6613;&#x66B4;&#x9732;&#x9886;&#x57DF;&#x5C42;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#x903B;&#x8F91;&#xFF1B;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5F53;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x6216;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x53D1;&#x751F;&#x670D;&#x52A1;&#x53D8;&#x66F4;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x670D;&#x52A1;&#x540C;&#x65F6;&#x88AB;&#x591A;&#x5C42;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x548C;&#x7EC4;&#x5408;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x627E;&#x51FA;&#x54EA;&#x4E9B;&#x4E0A;&#x5C42;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x548C;&#x7EC4;&#x5408;&#x4E86;&#x5B83;&#xFF0C;&#x4E0D;&#x65B9;&#x4FBF;&#x901A;&#x77E5;&#x5230;&#x6240;&#x6709;&#x7684;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x65B9;&#x3002;</p>
<p><img src="../assets/images/5e901b4f7fa964b349e4d6f344786ea1.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x4E00;&#x5F20;&#x56FE;&#xFF0C;&#x5728;&#x677E;&#x6563;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x5B9E;&#x4F53;A&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x7EC4;&#x5408;&#x540E;&#xFF0C;&#x66B4;&#x9732;&#x7ED9;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;aFacade&#x3002;abDomainService&#x9886;&#x57DF;&#x670D;&#x52A1;&#x76F4;&#x63A5;&#x8D8A;&#x8FC7;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x66B4;&#x9732;&#x7ED9;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;abFacade&#x670D;&#x52A1;&#x3002;&#x677E;&#x6563;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#x4EFB;&#x610F;&#x4E0B;&#x5C42;&#x670D;&#x52A1;&#x90FD;&#x53EF;&#x4EE5;&#x66B4;&#x9732;&#x7ED9;&#x4E0A;&#x5C42;&#x670D;&#x52A1;&#x3002;</p>
<p><img src="../assets/images/b35d6fed54e26423c0d61de040ab04a0.jpeg" alt=""></p>
<p><strong>&#x4E25;&#x683C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x670D;&#x52A1;&#x4F9D;&#x8D56;</strong></p>
<p>&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x5728;&#x4E25;&#x683C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x670D;&#x52A1;&#x53EA;&#x80FD;&#x5411;&#x7D27;&#x90BB;&#x7684;&#x4E0A;&#x4E00;&#x5C42;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x867D;&#x7136;&#x5B9E;&#x4F53;&#x3001;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x548C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x90FD;&#x5728;&#x9886;&#x57DF;&#x5C42;&#xFF0C;&#x4F46;&#x5B9E;&#x4F53;&#x548C;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x53EA;&#x80FD;&#x66B4;&#x9732;&#x7ED9;&#x9886;&#x57DF;&#x670D;&#x52A1;&#xFF0C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x53EA;&#x80FD;&#x66B4;&#x9732;&#x7ED9;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5728;&#x4E25;&#x683C;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x5982;&#x679C;&#x9700;&#x8981;&#x8DE8;&#x5C42;&#x8C03;&#x7528;&#xFF0C;&#x4E0B;&#x5C42;&#x670D;&#x52A1;&#x9700;&#x8981;&#x5728;&#x4E0A;&#x5C42;&#x5C01;&#x88C5;&#x540E;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x8DE8;&#x5C42;&#x670D;&#x52A1;&#x3002;&#x6BD4;&#x5982;&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x5411;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x5C01;&#x88C5;&#x6210;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x901A;&#x8FC7;&#x5C01;&#x88C5;&#x4F60;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5C06;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x5B9E;&#x73B0;&#x66B4;&#x9732;&#x7ED9;&#x5916;&#x90E8;&#xFF0C;&#x5C06;&#x5B9E;&#x4F53;&#x548C;&#x65B9;&#x6CD5;&#x5C01;&#x88C5;&#x6210;&#x9886;&#x57DF;&#x670D;&#x52A1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x6C89;&#x6DC0;&#x8FC7;&#x591A;&#x7684;&#x672C;&#x8BE5;&#x5C5E;&#x4E8E;&#x9886;&#x57DF;&#x5C42;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x907F;&#x514D;&#x5E94;&#x7528;&#x5C42;&#x53D8;&#x5F97;&#x81C3;&#x80BF;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x5F53;&#x670D;&#x52A1;&#x53D1;&#x751F;&#x53D8;&#x66F4;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x670D;&#x52A1;&#x53EA;&#x88AB;&#x7D27;&#x90BB;&#x4E0A;&#x5C42;&#x7684;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x548C;&#x7EC4;&#x5408;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x9010;&#x7EA7;&#x544A;&#x77E5;&#x7D27;&#x90BB;&#x4E0A;&#x5C42;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x670D;&#x52A1;&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x6BD4;&#x677E;&#x6563;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x8981;&#x597D;&#x662F;&#x4E00;&#x5B9A;&#x7684;&#x3002;</p>
<p><img src="../assets/images/ab304d69ee174b5e69cb63d79864ca07.png" alt=""></p>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x770B;&#x56FE;&#xFF0C;A&#x5B9E;&#x4F53;&#x65B9;&#x6CD5;&#x9700;&#x5C01;&#x88C5;&#x6210;&#x9886;&#x57DF;&#x670D;&#x52A1;aDomainService&#x624D;&#x80FD;&#x66B4;&#x9732;&#x7ED9;&#x5E94;&#x7528;&#x670D;&#x52A1;aAppService&#x3002;abDomainService&#x9886;&#x57DF;&#x670D;&#x52A1;&#x7EC4;&#x5408;&#x548C;&#x5C01;&#x88C5;A&#x548C;B&#x5B9E;&#x4F53;&#x7684;&#x65B9;&#x6CD5;&#x540E;&#xFF0C;&#x66B4;&#x9732;&#x7ED9;&#x5E94;&#x7528;&#x670D;&#x52A1;abAppService&#x3002;</p>
<p><img src="../assets/images/348d60eac28c9dbf7d120d1b7159cdf9.png" alt=""></p>
<h2 id="&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x89C6;&#x56FE;">&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x89C6;&#x56FE;</h2>
<p>&#x5728;DDD&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x7684;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5206;&#x5E03;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x91CC;&#x3002;&#x5B83;&#x4EEC;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9636;&#x6BB5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x6001;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x518D;&#x56DE;&#x987E;&#x4E00;&#x4E0B; <a href="https://time.geekbang.org/column/article/152677" target="_blank">[&#x7B2C; 04 &#x8BB2;]</a>&#xFF0C;&#x8FD9;&#x4E00;&#x8BB2;&#x6709;&#x8BE6;&#x7EC6;&#x7684;&#x8BB2;&#x89E3;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x6709;&#x54EA;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF1F;&#x5B83;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x534F;&#x4F5C;&#x548C;&#x8F6C;&#x6362;&#x7684;&#xFF1F;</p>
<ul>
<li>&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x5BF9;&#x8C61;PO(Persistent Object)&#xFF0C;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x7ED3;&#x6784;&#x4E00;&#x4E00;&#x6620;&#x5C04;&#xFF0C;&#x662F;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8F7D;&#x4F53;&#x3002;</li>
<li>&#x9886;&#x57DF;&#x5BF9;&#x8C61;DO&#xFF08;Domain Object&#xFF09;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x662F;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x7684;&#x8F7D;&#x4F53;&#x3002;</li>
<li>&#x6570;&#x636E;&#x4F20;&#x8F93;&#x5BF9;&#x8C61;DTO&#xFF08;Data Transfer Object&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x524D;&#x7AEF;&#x4E0E;&#x5E94;&#x7528;&#x5C42;&#x6216;&#x8005;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x7EC4;&#x88C5;&#x548C;&#x4F20;&#x8F93;&#xFF0C;&#x662F;&#x5E94;&#x7528;&#x4E4B;&#x95F4;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x8F7D;&#x4F53;&#x3002;</li>
<li>&#x89C6;&#x56FE;&#x5BF9;&#x8C61;VO&#xFF08;View Object&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x5C01;&#x88C5;&#x5C55;&#x793A;&#x5C42;&#x6307;&#x5B9A;&#x9875;&#x9762;&#x6216;&#x7EC4;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x7ED3;&#x5408;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x770B;&#x770B;&#x5FAE;&#x670D;&#x52A1;&#x5404;&#x5C42;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x804C;&#x8D23;&#x548C;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="../assets/images/26dec215ba4359bdc30a1e2cc6007213.png" alt=""></p>
<p><strong>&#x57FA;&#x7840;&#x5C42;</strong></p>
<p>&#x57FA;&#x7840;&#x5C42;&#x7684;&#x4E3B;&#x8981;&#x5BF9;&#x8C61;&#x662F;PO&#x5BF9;&#x8C61;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5148;&#x5EFA;&#x7ACB;DO&#x548C;PO&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x3002;&#x5F53;DO&#x6570;&#x636E;&#x9700;&#x8981;&#x6301;&#x4E45;&#x5316;&#x65F6;&#xFF0C;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#x4F1A;&#x5C06;DO&#x8F6C;&#x6362;&#x4E3A;PO&#x5BF9;&#x8C61;&#xFF0C;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x5E93;&#x6301;&#x4E45;&#x5316;&#x64CD;&#x4F5C;&#x3002;&#x5F53;DO&#x6570;&#x636E;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#x65F6;&#xFF0C;&#x4ED3;&#x50A8;&#x670D;&#x52A1;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x5F62;&#x6210;PO&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x5C06;PO&#x8F6C;&#x6362;&#x4E3A;DO&#xFF0C;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;PO&#x548C;DO&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#x3002;&#x4F46;&#x4E5F;&#x6709;DO&#x548C;PO&#x591A;&#x5BF9;&#x591A;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5728;DO&#x548C;PO&#x6570;&#x636E;&#x8F6C;&#x6362;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x91CD;&#x7EC4;&#x3002;</p>
<p><strong>&#x9886;&#x57DF;&#x5C42;</strong></p>
<p>&#x9886;&#x57DF;&#x5C42;&#x7684;&#x4E3B;&#x8981;&#x5BF9;&#x8C61;&#x662F;DO&#x5BF9;&#x8C61;&#x3002;DO&#x662F;&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x636E;&#x548C;&#x4E1A;&#x52A1;&#x884C;&#x4E3A;&#x8F7D;&#x4F53;&#xFF0C;&#x627F;&#x8F7D;&#x7740;&#x57FA;&#x7840;&#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;&#x901A;&#x8FC7;DO&#x548C;PO&#x8F6C;&#x6362;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#x548C;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<p><strong>&#x5E94;&#x7528;&#x5C42;</strong></p>
<p>&#x5E94;&#x7528;&#x5C42;&#x7684;&#x4E3B;&#x8981;&#x5BF9;&#x8C61;&#x662F;DO&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x8C03;&#x7528;&#x5176;&#x5B83;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x670D;&#x52A1;&#xFF0C;DO&#x4F1A;&#x8F6C;&#x6362;&#x4E3A;DTO&#xFF0C;&#x5B8C;&#x6210;&#x8DE8;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6570;&#x636E;&#x7EC4;&#x88C5;&#x548C;&#x4F20;&#x8F93;&#x3002;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x5148;&#x5B8C;&#x6210;DTO&#x5230;DO&#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x63A5;&#x6536;DO&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x5904;&#x7406;&#x3002;&#x5982;&#x679C;DTO&#x4E0E;DO&#x662F;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x8FDB;&#x884C;DO&#x6570;&#x636E;&#x91CD;&#x7EC4;&#x3002;</p>
<p><strong>&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;</strong></p>
<p>&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x4F1A;&#x5B8C;&#x6210;DO&#x548C;DTO&#x7684;&#x4E92;&#x8F6C;&#xFF0C;&#x5B8C;&#x6210;&#x5FAE;&#x670D;&#x52A1;&#x4E0E;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x53CA;&#x8F6C;&#x6362;&#x3002;Facade&#x670D;&#x52A1;&#x4F1A;&#x5BF9;&#x591A;&#x4E2A;DO&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x7EC4;&#x88C5;&#xFF0C;&#x8F6C;&#x6362;&#x4E3A;DTO&#x5BF9;&#x8C61;&#xFF0C;&#x5411;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x548C;&#x4F20;&#x8F93;&#x3002;</p>
<p><strong>&#x524D;&#x7AEF;&#x5E94;&#x7528;</strong></p>
<p>&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x4E3B;&#x8981;&#x662F;VO&#x5BF9;&#x8C61;&#x3002;&#x5C55;&#x73B0;&#x5C42;&#x4F7F;&#x7528;VO&#x8FDB;&#x884C;&#x754C;&#x9762;&#x5C55;&#x793A;&#xFF0C;&#x901A;&#x8FC7;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x4E0E;&#x5E94;&#x7528;&#x5C42;&#x91C7;&#x7528;DTO&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x4E86;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4E0B;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x670D;&#x52A1;&#x548C;&#x6570;&#x636E;&#x7684;&#x534F;&#x4F5C;&#x5173;&#x7CFB;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x4EE5;&#x53CA;&#x5FAE;&#x670D;&#x52A1;&#x5404;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6BCF;&#x5C42;&#x5B9A;&#x4E49;&#x4E86;&#x4E0D;&#x540C;&#x804C;&#x8D23;&#x7684;&#x670D;&#x52A1;&#x548C;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E25;&#x683C;&#x9075;&#x5B88;&#x5404;&#x5C42;&#x670D;&#x52A1;&#x548C;&#x6570;&#x636E;&#x7684;&#x804C;&#x8D23;&#x8981;&#x6C42;&#xFF0C;&#x5404;&#x636E;&#x5176;&#x4F4D;&#xFF0C;&#x5404;&#x53F8;&#x5176;&#x804C;&#x3002;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x6838;&#x5FC3;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x7A33;&#x5B9A;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x5E94;&#x5BF9;&#x5916;&#x90E8;&#x9700;&#x6C42;&#x7684;&#x5FEB;&#x901F;&#x53D8;&#x5316;&#x3002;</p>
<h2 id="&#x601D;&#x8003;&#x9898;">&#x601D;&#x8003;&#x9898;</h2>
<p>&#x4F60;&#x77E5;&#x9053;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8BBE;&#x8BA1;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x5417;&#xFF1F;&#x5B83;&#x4F53;&#x73B0;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#xFF1F;</p>
<p>&#x6B22;&#x8FCE;&#x7559;&#x8A00;&#x548C;&#x6211;&#x5206;&#x4EAB;&#x4F60;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x4ECA;&#x5929;&#x6240;&#x5B66;&#x5206;&#x4EAB;&#x7ED9;&#x8EAB;&#x8FB9;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x9080;&#x8BF7;&#x4ED6;&#x52A0;&#x5165;&#x63A2;&#x8BA8;&#xFF0C;&#x5171;&#x540C;&#x8FDB;&#x6B65;&#x3002;</p>
<p><img src="../assets/images/7b1a917aff0ec923b78a54e81ed90733_4.jpg" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="166635.html" class="navigation navigation-prev " aria-label="Previous page: 15 | 边界：微服务的各种边界在架构演进中的作用？">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="169017.html" class="navigation navigation-next " aria-label="Next page: 17 | 从后端到前端：微服务后，前端如何设计？">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"16 | 视图：如何实现服务和数据在微服务各层的协作？","level":"5.6","depth":1,"next":{"title":"17 | 从后端到前端：微服务后，前端如何设计？","level":"5.7","depth":1,"path":"docs/169017.md","ref":"./docs/169017.md","articles":[]},"previous":{"title":"15 | 边界：微服务的各种边界在架构演进中的作用？","level":"5.5","depth":1,"path":"docs/166635.md","ref":"./docs/166635.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css","website":"styles/website.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"d4t":{"nav":[{"url":"../book_10x_cheng_xu_yuan_gong_zuo_fa/","target":"_self","name":"10x程序员工作法"},{"url":"../book_da_chang_jin_sheng_zhi_nan/","target":"_self","name":"大厂晋升指南"},{"url":"https://github.com/auohh/","target":"_blank","name":"Github"}]}},"title":"DDD实战课","language":"zh","gitbook":"*"},"file":{"path":"docs/167710.md","mtime":"2025-10-30T15:39:20.762Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2025-10-30T15:40:20.318Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

